;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
;* Date/Time created: Wed Jul 24 10:05:28 2019                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("CANProtocal.C")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Drive0X\trunk\16-PEU11C33\03-C33M07-ABS\app\source")
	.global	_Speed
_Speed:	.usect	".ebss",1,1,0
$C$DW$1	.dwtag  DW_TAG_variable, DW_AT_name("Speed")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_Speed")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr _Speed]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1, DW_AT_decl_column(0x08)
	.global	_DgnsR_ID2
_DgnsR_ID2:	.usect	".ebss",1,1,0
$C$DW$2	.dwtag  DW_TAG_variable, DW_AT_name("DgnsR_ID2")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_DgnsR_ID2")
	.dwattr $C$DW$2, DW_AT_location[DW_OP_addr _DgnsR_ID2]
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$89)
	.dwattr $C$DW$2, DW_AT_external

$C$DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$25, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x19)

$C$DW$T$397	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$397, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$397, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$397, DW_AT_byte_size(0x04)
$C$DW$314	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$314, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$397


$C$DW$T$398	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$398, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$398, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$398, DW_AT_byte_size(0x0c)
$C$DW$315	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$315, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$398


$C$DW$T$399	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$399, DW_AT_byte_size(0x08)
$C$DW$316	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$316, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$399

$C$DW$317	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$25)
$C$DW$T$647	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$647, DW_AT_type(*$C$DW$317)
$C$DW$T$508	.dwtag  DW_TAG_typedef, DW_AT_name("uword")
	.dwattr $C$DW$T$508, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$508, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$508, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$508, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$508, DW_AT_decl_column(0x19)
$C$DW$T$513	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$513, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$513, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$513, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$513, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$513, DW_AT_decl_column(0x19)
$C$DW$T$524	.dwtag  DW_TAG_typedef, DW_AT_name("uint32")
	.dwattr $C$DW$T$524, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$524, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$524, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$524, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$524, DW_AT_decl_column(0x19)
$C$DW$T$648	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$648, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$648, DW_AT_address_class(0x16)
$C$DW$T$649	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$649, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$649, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$649, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$649, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$649, DW_AT_decl_column(0x1b)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$651	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$651, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$651, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$651, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$651, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$651, DW_AT_decl_column(0x1a)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$652	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$652, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$652, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$652, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$652, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$652, DW_AT_decl_column(0x1d)
$C$DW$T$653	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$653, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$653, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$653, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$653, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$653, DW_AT_decl_column(0x1e)
$C$DW$T$654	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$654, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$654, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$654, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$654, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$654, DW_AT_decl_column(0x1e)
$C$DW$T$655	.dwtag  DW_TAG_typedef, DW_AT_name("QWORD")
	.dwattr $C$DW$T$655, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$655, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$655, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$655, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$655, DW_AT_decl_column(0x1e)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$656	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$656, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$656, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$656, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$656, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$656, DW_AT_decl_column(0x1a)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$657	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$657, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$657, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$657, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$657, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$657, DW_AT_decl_column(0x1a)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$318, DW_AT_name("EXTMSGID_L")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_EXTMSGID_L")
	.dwattr $C$DW$318, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x36)
	.dwattr $C$DW$318, DW_AT_decl_column(0x15)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$319, DW_AT_name("EXTMSGID_H")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_EXTMSGID_H")
	.dwattr $C$DW$319, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x37)
	.dwattr $C$DW$319, DW_AT_decl_column(0x15)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$320, DW_AT_name("STDMSGID")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_STDMSGID")
	.dwattr $C$DW$320, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x0b)
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x38)
	.dwattr $C$DW$320, DW_AT_decl_column(0x15)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$321, DW_AT_name("AAM")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_AAM")
	.dwattr $C$DW$321, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x39)
	.dwattr $C$DW$321, DW_AT_decl_column(0x18)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$322, DW_AT_name("AME")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_AME")
	.dwattr $C$DW$322, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$322, DW_AT_decl_column(0x18)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$323, DW_AT_name("IDE")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_IDE")
	.dwattr $C$DW$323, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$323, DW_AT_decl_column(0x18)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$324, DW_AT_name("DataLength")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_DataLength")
	.dwattr $C$DW$324, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$324, DW_AT_decl_column(0x11)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$325, DW_AT_name("RTR")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_RTR")
	.dwattr $C$DW$325, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$325, DW_AT_decl_column(0x11)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$326, DW_AT_name("Res2")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_Res2")
	.dwattr $C$DW$326, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x03)
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$326, DW_AT_decl_column(0x10)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$327, DW_AT_name("TransmitPriority")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_TransmitPriority")
	.dwattr $C$DW$327, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$327, DW_AT_decl_column(0x10)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$328, DW_AT_name("Res3")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_Res3")
	.dwattr $C$DW$328, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x03)
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x40)
	.dwattr $C$DW$328, DW_AT_decl_column(0x10)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$329, DW_AT_name("Reserved")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_Reserved")
	.dwattr $C$DW$329, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x41)
	.dwattr $C$DW$329, DW_AT_decl_column(0x10)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$330, DW_AT_name("Data")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_Data")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x42)
	.dwattr $C$DW$330, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x09)

$C$DW$T$22	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$22, DW_AT_name("J1939_MESSAGE_UNION")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x08)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$331, DW_AT_name("FormatMsg")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_FormatMsg")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x43)
	.dwattr $C$DW$331, DW_AT_decl_column(0x03)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$332, DW_AT_name("Array")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_Array")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x44)
	.dwattr $C$DW$332, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x07)
$C$DW$T$626	.dwtag  DW_TAG_typedef, DW_AT_name("J1939_MESSAGE")
	.dwattr $C$DW$T$626, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$626, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$626, DW_AT_decl_file("../include/CANProtocal.h")
	.dwattr $C$DW$T$626, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$626, DW_AT_decl_column(0x23)
$C$DW$T$627	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$627, DW_AT_type(*$C$DW$T$626)
	.dwattr $C$DW$T$627, DW_AT_address_class(0x16)

$C$DW$T$658	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$626)
	.dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$658, DW_AT_byte_size(0x28)
$C$DW$333	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$333, DW_AT_upper_bound(0x04)
	.dwendtag $C$DW$T$658


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("CANME_BITS")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$334, DW_AT_name("ME0")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_ME0")
	.dwattr $C$DW$334, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x19)
	.dwattr $C$DW$334, DW_AT_decl_column(0x10)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$335, DW_AT_name("ME1")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_ME1")
	.dwattr $C$DW$335, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$335, DW_AT_decl_column(0x10)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$336, DW_AT_name("ME2")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_ME2")
	.dwattr $C$DW$336, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$336, DW_AT_decl_column(0x10)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$337, DW_AT_name("ME3")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_ME3")
	.dwattr $C$DW$337, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$337, DW_AT_decl_column(0x10)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$338, DW_AT_name("ME4")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_ME4")
	.dwattr $C$DW$338, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$338, DW_AT_decl_column(0x10)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$339, DW_AT_name("ME5")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_ME5")
	.dwattr $C$DW$339, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$339, DW_AT_decl_column(0x10)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$340, DW_AT_name("ME6")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_ME6")
	.dwattr $C$DW$340, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$340, DW_AT_decl_column(0x10)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$341, DW_AT_name("ME7")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_ME7")
	.dwattr $C$DW$341, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x20)
	.dwattr $C$DW$341, DW_AT_decl_column(0x10)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$342, DW_AT_name("ME8")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_ME8")
	.dwattr $C$DW$342, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x21)
	.dwattr $C$DW$342, DW_AT_decl_column(0x10)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$343, DW_AT_name("ME9")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_ME9")
	.dwattr $C$DW$343, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x22)
	.dwattr $C$DW$343, DW_AT_decl_column(0x10)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$344, DW_AT_name("ME10")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_ME10")
	.dwattr $C$DW$344, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x23)
	.dwattr $C$DW$344, DW_AT_decl_column(0x10)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$345, DW_AT_name("ME11")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_ME11")
	.dwattr $C$DW$345, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x24)
	.dwattr $C$DW$345, DW_AT_decl_column(0x10)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$346, DW_AT_name("ME12")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_ME12")
	.dwattr $C$DW$346, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x25)
	.dwattr $C$DW$346, DW_AT_decl_column(0x10)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$347, DW_AT_name("ME13")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_ME13")
	.dwattr $C$DW$347, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x26)
	.dwattr $C$DW$347, DW_AT_decl_column(0x10)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$348, DW_AT_name("ME14")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_ME14")
	.dwattr $C$DW$348, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x27)
	.dwattr $C$DW$348, DW_AT_decl_column(0x10)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$349, DW_AT_name("ME15")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_ME15")
	.dwattr $C$DW$349, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x28)
	.dwattr $C$DW$349, DW_AT_decl_column(0x10)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$350, DW_AT_name("ME16")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_ME16")
	.dwattr $C$DW$350, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x29)
	.dwattr $C$DW$350, DW_AT_decl_column(0x10)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$351, DW_AT_name("ME17")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_ME17")
	.dwattr $C$DW$351, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$351, DW_AT_decl_column(0x10)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$352, DW_AT_name("ME18")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_ME18")
	.dwattr $C$DW$352, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$352, DW_AT_decl_column(0x10)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$353, DW_AT_name("ME19")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_ME19")
	.dwattr $C$DW$353, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$353, DW_AT_decl_column(0x10)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$354, DW_AT_name("ME20")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_ME20")
	.dwattr $C$DW$354, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$354, DW_AT_decl_column(0x10)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$355, DW_AT_name("ME21")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_ME21")
	.dwattr $C$DW$355, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$355, DW_AT_decl_column(0x10)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$356, DW_AT_name("ME22")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_ME22")
	.dwattr $C$DW$356, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$356, DW_AT_decl_column(0x10)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$357, DW_AT_name("ME23")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_ME23")
	.dwattr $C$DW$357, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x30)
	.dwattr $C$DW$357, DW_AT_decl_column(0x10)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$358, DW_AT_name("ME24")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_ME24")
	.dwattr $C$DW$358, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x31)
	.dwattr $C$DW$358, DW_AT_decl_column(0x10)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$359, DW_AT_name("ME25")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_ME25")
	.dwattr $C$DW$359, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x32)
	.dwattr $C$DW$359, DW_AT_decl_column(0x10)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$360, DW_AT_name("ME26")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_ME26")
	.dwattr $C$DW$360, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x33)
	.dwattr $C$DW$360, DW_AT_decl_column(0x10)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$361, DW_AT_name("ME27")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_ME27")
	.dwattr $C$DW$361, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x34)
	.dwattr $C$DW$361, DW_AT_decl_column(0x10)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$362, DW_AT_name("ME28")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_ME28")
	.dwattr $C$DW$362, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x35)
	.dwattr $C$DW$362, DW_AT_decl_column(0x10)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$363, DW_AT_name("ME29")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_ME29")
	.dwattr $C$DW$363, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x36)
	.dwattr $C$DW$363, DW_AT_decl_column(0x10)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$364, DW_AT_name("ME30")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_ME30")
	.dwattr $C$DW$364, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x37)
	.dwattr $C$DW$364, DW_AT_decl_column(0x10)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$365, DW_AT_name("ME31")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_ME31")
	.dwattr $C$DW$365, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x38)
	.dwattr $C$DW$365, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x09)

$C$DW$T$26	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$26, DW_AT_name("CANME_REG")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$366, DW_AT_name("all")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$366, DW_AT_decl_column(0x17)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$367, DW_AT_name("bit")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$367, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x07)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("CANMD_BITS")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$368, DW_AT_name("MD0")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_MD0")
	.dwattr $C$DW$368, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x44)
	.dwattr $C$DW$368, DW_AT_decl_column(0x10)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$369, DW_AT_name("MD1")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_MD1")
	.dwattr $C$DW$369, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x45)
	.dwattr $C$DW$369, DW_AT_decl_column(0x10)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$370, DW_AT_name("MD2")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_MD2")
	.dwattr $C$DW$370, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x46)
	.dwattr $C$DW$370, DW_AT_decl_column(0x10)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$371, DW_AT_name("MD3")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_MD3")
	.dwattr $C$DW$371, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x47)
	.dwattr $C$DW$371, DW_AT_decl_column(0x10)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$372, DW_AT_name("MD4")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_MD4")
	.dwattr $C$DW$372, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x48)
	.dwattr $C$DW$372, DW_AT_decl_column(0x10)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$373, DW_AT_name("MD5")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_MD5")
	.dwattr $C$DW$373, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x49)
	.dwattr $C$DW$373, DW_AT_decl_column(0x10)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$374, DW_AT_name("MD6")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_MD6")
	.dwattr $C$DW$374, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$374, DW_AT_decl_column(0x10)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$375, DW_AT_name("MD7")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_MD7")
	.dwattr $C$DW$375, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$375, DW_AT_decl_column(0x10)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$376, DW_AT_name("MD8")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_MD8")
	.dwattr $C$DW$376, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$376, DW_AT_decl_column(0x10)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$377, DW_AT_name("MD9")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_MD9")
	.dwattr $C$DW$377, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$377, DW_AT_decl_column(0x10)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$378, DW_AT_name("MD10")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_MD10")
	.dwattr $C$DW$378, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$378, DW_AT_decl_column(0x10)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$379, DW_AT_name("MD11")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_MD11")
	.dwattr $C$DW$379, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$379, DW_AT_decl_column(0x10)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$380, DW_AT_name("MD12")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_MD12")
	.dwattr $C$DW$380, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x50)
	.dwattr $C$DW$380, DW_AT_decl_column(0x10)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$381, DW_AT_name("MD13")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_MD13")
	.dwattr $C$DW$381, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x51)
	.dwattr $C$DW$381, DW_AT_decl_column(0x10)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$382, DW_AT_name("MD14")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_MD14")
	.dwattr $C$DW$382, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x52)
	.dwattr $C$DW$382, DW_AT_decl_column(0x10)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$383, DW_AT_name("MD15")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_MD15")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x53)
	.dwattr $C$DW$383, DW_AT_decl_column(0x10)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$384, DW_AT_name("MD16")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_MD16")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x54)
	.dwattr $C$DW$384, DW_AT_decl_column(0x10)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$385, DW_AT_name("MD17")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_MD17")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x55)
	.dwattr $C$DW$385, DW_AT_decl_column(0x10)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$386, DW_AT_name("MD18")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_MD18")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x56)
	.dwattr $C$DW$386, DW_AT_decl_column(0x10)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$387, DW_AT_name("MD19")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_MD19")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x57)
	.dwattr $C$DW$387, DW_AT_decl_column(0x10)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$388, DW_AT_name("MD20")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_MD20")
	.dwattr $C$DW$388, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x58)
	.dwattr $C$DW$388, DW_AT_decl_column(0x10)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$389, DW_AT_name("MD21")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_MD21")
	.dwattr $C$DW$389, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x59)
	.dwattr $C$DW$389, DW_AT_decl_column(0x10)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$390, DW_AT_name("MD22")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_MD22")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$390, DW_AT_decl_column(0x10)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$391, DW_AT_name("MD23")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_MD23")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$391, DW_AT_decl_column(0x10)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$392, DW_AT_name("MD24")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_MD24")
	.dwattr $C$DW$392, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$392, DW_AT_decl_column(0x10)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$393, DW_AT_name("MD25")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_MD25")
	.dwattr $C$DW$393, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$393, DW_AT_decl_column(0x10)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$394, DW_AT_name("MD26")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_MD26")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$394, DW_AT_decl_column(0x10)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$395, DW_AT_name("MD27")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_MD27")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$395, DW_AT_decl_column(0x10)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$396, DW_AT_name("MD28")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_MD28")
	.dwattr $C$DW$396, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x60)
	.dwattr $C$DW$396, DW_AT_decl_column(0x10)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$397, DW_AT_name("MD29")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_MD29")
	.dwattr $C$DW$397, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x61)
	.dwattr $C$DW$397, DW_AT_decl_column(0x10)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$398, DW_AT_name("MD30")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_MD30")
	.dwattr $C$DW$398, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x62)
	.dwattr $C$DW$398, DW_AT_decl_column(0x10)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$399, DW_AT_name("MD31")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_MD31")
	.dwattr $C$DW$399, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x63)
	.dwattr $C$DW$399, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x09)

$C$DW$T$28	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$28, DW_AT_name("CANMD_REG")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$400, DW_AT_name("all")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x69)
	.dwattr $C$DW$400, DW_AT_decl_column(0x17)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$401, DW_AT_name("bit")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$401, DW_AT_decl_column(0x17)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x07)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("CANTRS_BITS")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$402, DW_AT_name("TRS0")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_TRS0")
	.dwattr $C$DW$402, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$402, DW_AT_decl_column(0x10)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$403, DW_AT_name("TRS1")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_TRS1")
	.dwattr $C$DW$403, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0x70)
	.dwattr $C$DW$403, DW_AT_decl_column(0x10)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$404, DW_AT_name("TRS2")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_TRS2")
	.dwattr $C$DW$404, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0x71)
	.dwattr $C$DW$404, DW_AT_decl_column(0x10)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$405, DW_AT_name("TRS3")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_TRS3")
	.dwattr $C$DW$405, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0x72)
	.dwattr $C$DW$405, DW_AT_decl_column(0x10)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$406, DW_AT_name("TRS4")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_TRS4")
	.dwattr $C$DW$406, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0x73)
	.dwattr $C$DW$406, DW_AT_decl_column(0x10)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$407, DW_AT_name("TRS5")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_TRS5")
	.dwattr $C$DW$407, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0x74)
	.dwattr $C$DW$407, DW_AT_decl_column(0x10)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$408, DW_AT_name("TRS6")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_TRS6")
	.dwattr $C$DW$408, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0x75)
	.dwattr $C$DW$408, DW_AT_decl_column(0x10)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$409, DW_AT_name("TRS7")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_TRS7")
	.dwattr $C$DW$409, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0x76)
	.dwattr $C$DW$409, DW_AT_decl_column(0x10)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$410, DW_AT_name("TRS8")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_TRS8")
	.dwattr $C$DW$410, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0x77)
	.dwattr $C$DW$410, DW_AT_decl_column(0x10)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$411, DW_AT_name("TRS9")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_TRS9")
	.dwattr $C$DW$411, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0x78)
	.dwattr $C$DW$411, DW_AT_decl_column(0x10)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$412, DW_AT_name("TRS10")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_TRS10")
	.dwattr $C$DW$412, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0x79)
	.dwattr $C$DW$412, DW_AT_decl_column(0x10)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$413, DW_AT_name("TRS11")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_TRS11")
	.dwattr $C$DW$413, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$413, DW_AT_decl_column(0x10)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$414, DW_AT_name("TRS12")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_TRS12")
	.dwattr $C$DW$414, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$414, DW_AT_decl_column(0x10)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$415, DW_AT_name("TRS13")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_TRS13")
	.dwattr $C$DW$415, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$415, DW_AT_decl_column(0x10)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$416, DW_AT_name("TRS14")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_TRS14")
	.dwattr $C$DW$416, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$416, DW_AT_decl_column(0x10)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$417, DW_AT_name("TRS15")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_TRS15")
	.dwattr $C$DW$417, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$417, DW_AT_decl_column(0x10)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$418, DW_AT_name("TRS16")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_TRS16")
	.dwattr $C$DW$418, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$418, DW_AT_decl_column(0x10)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$419, DW_AT_name("TRS17")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_TRS17")
	.dwattr $C$DW$419, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0x80)
	.dwattr $C$DW$419, DW_AT_decl_column(0x10)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$420, DW_AT_name("TRS18")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_TRS18")
	.dwattr $C$DW$420, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0x81)
	.dwattr $C$DW$420, DW_AT_decl_column(0x10)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$421, DW_AT_name("TRS19")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_TRS19")
	.dwattr $C$DW$421, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0x82)
	.dwattr $C$DW$421, DW_AT_decl_column(0x10)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$422, DW_AT_name("TRS20")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_TRS20")
	.dwattr $C$DW$422, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0x83)
	.dwattr $C$DW$422, DW_AT_decl_column(0x10)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$423, DW_AT_name("TRS21")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_TRS21")
	.dwattr $C$DW$423, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0x84)
	.dwattr $C$DW$423, DW_AT_decl_column(0x10)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$424, DW_AT_name("TRS22")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_TRS22")
	.dwattr $C$DW$424, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0x85)
	.dwattr $C$DW$424, DW_AT_decl_column(0x10)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$425, DW_AT_name("TRS23")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_TRS23")
	.dwattr $C$DW$425, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0x86)
	.dwattr $C$DW$425, DW_AT_decl_column(0x10)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$426, DW_AT_name("TRS24")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_TRS24")
	.dwattr $C$DW$426, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0x87)
	.dwattr $C$DW$426, DW_AT_decl_column(0x10)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$427, DW_AT_name("TRS25")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_TRS25")
	.dwattr $C$DW$427, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0x88)
	.dwattr $C$DW$427, DW_AT_decl_column(0x10)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$428, DW_AT_name("TRS26")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_TRS26")
	.dwattr $C$DW$428, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0x89)
	.dwattr $C$DW$428, DW_AT_decl_column(0x10)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$429, DW_AT_name("TRS27")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_TRS27")
	.dwattr $C$DW$429, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$429, DW_AT_decl_column(0x10)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$430, DW_AT_name("TRS28")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_TRS28")
	.dwattr $C$DW$430, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$430, DW_AT_decl_column(0x10)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$431, DW_AT_name("TRS29")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_TRS29")
	.dwattr $C$DW$431, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$431, DW_AT_decl_column(0x10)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$432, DW_AT_name("TRS30")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_TRS30")
	.dwattr $C$DW$432, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$432, DW_AT_decl_column(0x10)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$433, DW_AT_name("TRS31")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_TRS31")
	.dwattr $C$DW$433, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$433, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x09)

$C$DW$T$30	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$30, DW_AT_name("CANTRS_REG")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$434, DW_AT_name("all")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0x94)
	.dwattr $C$DW$434, DW_AT_decl_column(0x18)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$435, DW_AT_name("bit")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0x95)
	.dwattr $C$DW$435, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x07)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_name("CANTRR_BITS")
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$436, DW_AT_name("TRR0")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_TRR0")
	.dwattr $C$DW$436, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$436, DW_AT_decl_column(0x10)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$437, DW_AT_name("TRR1")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_TRR1")
	.dwattr $C$DW$437, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$437, DW_AT_decl_column(0x10)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$438, DW_AT_name("TRR2")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_TRR2")
	.dwattr $C$DW$438, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$438, DW_AT_decl_column(0x10)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$439, DW_AT_name("TRR3")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_TRR3")
	.dwattr $C$DW$439, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$439, DW_AT_decl_column(0x10)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$440, DW_AT_name("TRR4")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_TRR4")
	.dwattr $C$DW$440, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$440, DW_AT_decl_column(0x10)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$441, DW_AT_name("TRR5")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_TRR5")
	.dwattr $C$DW$441, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$441, DW_AT_decl_column(0x10)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$442, DW_AT_name("TRR6")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_TRR6")
	.dwattr $C$DW$442, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$442, DW_AT_decl_column(0x10)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$443, DW_AT_name("TRR7")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_TRR7")
	.dwattr $C$DW$443, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$443, DW_AT_decl_column(0x10)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$444, DW_AT_name("TRR8")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_TRR8")
	.dwattr $C$DW$444, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$444, DW_AT_decl_column(0x10)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$445, DW_AT_name("TRR9")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_TRR9")
	.dwattr $C$DW$445, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$445, DW_AT_decl_column(0x10)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$446, DW_AT_name("TRR10")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_TRR10")
	.dwattr $C$DW$446, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$446, DW_AT_decl_column(0x10)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$447, DW_AT_name("TRR11")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_TRR11")
	.dwattr $C$DW$447, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$447, DW_AT_decl_column(0x10)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$448, DW_AT_name("TRR12")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_TRR12")
	.dwattr $C$DW$448, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$448, DW_AT_decl_column(0x10)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$449, DW_AT_name("TRR13")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_TRR13")
	.dwattr $C$DW$449, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$449, DW_AT_decl_column(0x10)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$450, DW_AT_name("TRR14")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_TRR14")
	.dwattr $C$DW$450, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$450, DW_AT_decl_column(0x10)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$451, DW_AT_name("TRR15")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_TRR15")
	.dwattr $C$DW$451, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$451, DW_AT_decl_column(0x10)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$452, DW_AT_name("TRR16")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_TRR16")
	.dwattr $C$DW$452, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$452, DW_AT_decl_column(0x10)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$453, DW_AT_name("TRR17")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_TRR17")
	.dwattr $C$DW$453, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0xab)
	.dwattr $C$DW$453, DW_AT_decl_column(0x10)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$454, DW_AT_name("TRR18")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_TRR18")
	.dwattr $C$DW$454, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0xac)
	.dwattr $C$DW$454, DW_AT_decl_column(0x10)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$455, DW_AT_name("TRR19")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_TRR19")
	.dwattr $C$DW$455, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0xad)
	.dwattr $C$DW$455, DW_AT_decl_column(0x10)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$456, DW_AT_name("TRR20")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_TRR20")
	.dwattr $C$DW$456, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0xae)
	.dwattr $C$DW$456, DW_AT_decl_column(0x10)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$457, DW_AT_name("TRR21")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_TRR21")
	.dwattr $C$DW$457, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$457, DW_AT_decl_column(0x10)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$458, DW_AT_name("TRR22")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_TRR22")
	.dwattr $C$DW$458, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$458, DW_AT_decl_column(0x10)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$459, DW_AT_name("TRR23")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_TRR23")
	.dwattr $C$DW$459, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$459, DW_AT_decl_column(0x10)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$460, DW_AT_name("TRR24")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_TRR24")
	.dwattr $C$DW$460, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$460, DW_AT_decl_column(0x10)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$461, DW_AT_name("TRR25")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_TRR25")
	.dwattr $C$DW$461, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$461, DW_AT_decl_column(0x10)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$462, DW_AT_name("TRR26")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_TRR26")
	.dwattr $C$DW$462, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$462, DW_AT_decl_column(0x10)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$463, DW_AT_name("TRR27")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_TRR27")
	.dwattr $C$DW$463, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$463, DW_AT_decl_column(0x10)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$464, DW_AT_name("TRR28")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_TRR28")
	.dwattr $C$DW$464, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$464, DW_AT_decl_column(0x10)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$465, DW_AT_name("TRR29")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_TRR29")
	.dwattr $C$DW$465, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$465, DW_AT_decl_column(0x10)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$466, DW_AT_name("TRR30")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_TRR30")
	.dwattr $C$DW$466, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$466, DW_AT_decl_column(0x10)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$467, DW_AT_name("TRR31")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_TRR31")
	.dwattr $C$DW$467, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$467, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x99)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x09)

$C$DW$T$32	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$32, DW_AT_name("CANTRR_REG")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$468, DW_AT_name("all")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$468, DW_AT_decl_column(0x18)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$469, DW_AT_name("bit")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$469, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x07)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("CANTA_BITS")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$470, DW_AT_name("TA0")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_TA0")
	.dwattr $C$DW$470, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$470, DW_AT_decl_column(0x10)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$471, DW_AT_name("TA1")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_TA1")
	.dwattr $C$DW$471, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$471, DW_AT_decl_column(0x10)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$472, DW_AT_name("TA2")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_TA2")
	.dwattr $C$DW$472, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$472, DW_AT_decl_column(0x10)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$473, DW_AT_name("TA3")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_TA3")
	.dwattr $C$DW$473, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$473, DW_AT_decl_column(0x10)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$474, DW_AT_name("TA4")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_TA4")
	.dwattr $C$DW$474, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$474, DW_AT_decl_column(0x10)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$475, DW_AT_name("TA5")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_TA5")
	.dwattr $C$DW$475, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0xca)
	.dwattr $C$DW$475, DW_AT_decl_column(0x10)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$476, DW_AT_name("TA6")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_TA6")
	.dwattr $C$DW$476, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$476, DW_AT_decl_column(0x10)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$477, DW_AT_name("TA7")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_TA7")
	.dwattr $C$DW$477, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$477, DW_AT_decl_column(0x10)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$478, DW_AT_name("TA8")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_TA8")
	.dwattr $C$DW$478, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$478, DW_AT_decl_column(0x10)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$479, DW_AT_name("TA9")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_TA9")
	.dwattr $C$DW$479, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0xce)
	.dwattr $C$DW$479, DW_AT_decl_column(0x10)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$480, DW_AT_name("TA10")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_TA10")
	.dwattr $C$DW$480, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$480, DW_AT_decl_column(0x10)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$481, DW_AT_name("TA11")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_TA11")
	.dwattr $C$DW$481, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$481, DW_AT_decl_column(0x10)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$482, DW_AT_name("TA12")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_TA12")
	.dwattr $C$DW$482, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$482, DW_AT_decl_column(0x10)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$483, DW_AT_name("TA13")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_TA13")
	.dwattr $C$DW$483, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$483, DW_AT_decl_column(0x10)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$484, DW_AT_name("TA14")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_TA14")
	.dwattr $C$DW$484, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$484, DW_AT_decl_column(0x10)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$485, DW_AT_name("TA15")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_TA15")
	.dwattr $C$DW$485, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$485, DW_AT_decl_column(0x10)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$486, DW_AT_name("TA16")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_TA16")
	.dwattr $C$DW$486, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$486, DW_AT_decl_column(0x10)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$487, DW_AT_name("TA17")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_TA17")
	.dwattr $C$DW$487, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$487, DW_AT_decl_column(0x10)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$488, DW_AT_name("TA18")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_TA18")
	.dwattr $C$DW$488, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$488, DW_AT_decl_column(0x10)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$489, DW_AT_name("TA19")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_TA19")
	.dwattr $C$DW$489, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$489, DW_AT_decl_column(0x10)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$490, DW_AT_name("TA20")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_TA20")
	.dwattr $C$DW$490, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$490, DW_AT_decl_column(0x10)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$491, DW_AT_name("TA21")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_TA21")
	.dwattr $C$DW$491, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0xda)
	.dwattr $C$DW$491, DW_AT_decl_column(0x10)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$492, DW_AT_name("TA22")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_TA22")
	.dwattr $C$DW$492, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$492, DW_AT_decl_column(0x10)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$493, DW_AT_name("TA23")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_TA23")
	.dwattr $C$DW$493, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("..\include\DSP2803x_ECan.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$493, DW_AT_decl_column(0x10)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$494, DW_AT_name("TA24")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_TA24")
	.dwattr $C$DW$494, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
