;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
;* Date/Time created: Wed Jul 24 10:05:37 2019                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("DSP2803x_DefaultIsr.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Drive0X\trunk\16-PEU11C33\03-C33M07-ABS\app\source")
$C$DW$1	.dwtag  DW_TAG_variable, DW_AT_name("PieCtrlRegs")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$505)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$1, DW_AT_decl_column(0x26)
;	C:\CCStudio_v3.3\C2000\cgtools\bin\opt2000.exe C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\048083 C:\\Users\\ADMINI~1\\AppData\\Local\\Temp\\048085 
;	C:\CCStudio_v3.3\C2000\cgtools\bin\ac2000.exe -@C:\Users\ADMINI~1\AppData\Local\Temp\0480812 
	.sect	".text"
	.global	_TINT1_ISR

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("TINT1_ISR")

	.dwattr $C$DW$T$492, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$492, DW_AT_decl_column(0x19)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$71, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x19)

$C$DW$T$374	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$374, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$374, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$374, DW_AT_byte_size(0x04)
$C$DW$171	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$171, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$374


$C$DW$T$375	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$375, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$375, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$375, DW_AT_byte_size(0x0c)
$C$DW$172	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$172, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$375


$C$DW$T$376	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$376, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$376, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$376, DW_AT_byte_size(0x08)
$C$DW$173	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$173, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$376

$C$DW$T$493	.dwtag  DW_TAG_typedef, DW_AT_name("uint32")
	.dwattr $C$DW$T$493, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$493, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$493, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$493, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$493, DW_AT_decl_column(0x19)
$C$DW$T$494	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$494, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$494, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$494, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$494, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$494, DW_AT_decl_column(0x19)
$C$DW$T$495	.dwtag  DW_TAG_typedef, DW_AT_name("uword")
	.dwattr $C$DW$T$495, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$495, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$495, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$495, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$495, DW_AT_decl_column(0x19)
$C$DW$T$496	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$496, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$496, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$496, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$496, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$496, DW_AT_decl_column(0x1b)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$497	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$497, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$497, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$497, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$497, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$497, DW_AT_decl_column(0x1a)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$498	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$498, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$498, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$498, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$498, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$498, DW_AT_decl_column(0x1d)
$C$DW$T$499	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$499, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$499, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$499, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$499, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$499, DW_AT_decl_column(0x1e)
$C$DW$T$500	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$500, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$500, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$500, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$500, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$500, DW_AT_decl_column(0x1e)
$C$DW$T$501	.dwtag  DW_TAG_typedef, DW_AT_name("QWORD")
	.dwattr $C$DW$T$501, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$501, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$501, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$501, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$501, DW_AT_decl_column(0x1e)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$502	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$502, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$502, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$502, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$502, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$502, DW_AT_decl_column(0x1a)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$503	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$503, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$503, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$503, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$503, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$503, DW_AT_decl_column(0x1a)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("PIECTRL_BITS")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$174, DW_AT_name("ENPIE")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_ENPIE")
	.dwattr $C$DW$174, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x18)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0c)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$175, DW_AT_name("PIEVECT")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_PIEVECT")
	.dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x19)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x17)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x08)

$C$DW$T$21	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$21, DW_AT_name("PIECTRL_REG")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$176, DW_AT_name("all")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$176, DW_AT_decl_column(0x1b)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$177, DW_AT_name("bit")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$177, DW_AT_decl_column(0x19)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x07)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("PIEACK_BITS")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$178, DW_AT_name("ACK1")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_ACK1")
	.dwattr $C$DW$178, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x47)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0b)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$179, DW_AT_name("ACK2")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_ACK2")
	.dwattr $C$DW$179, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x48)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0b)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$180, DW_AT_name("ACK3")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_ACK3")
	.dwattr $C$DW$180, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x49)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0b)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$181, DW_AT_name("ACK4")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_ACK4")
	.dwattr $C$DW$181, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0b)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$182, DW_AT_name("ACK5")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_ACK5")
	.dwattr $C$DW$182, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$182, DW_AT_decl_column(0x0b)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$183, DW_AT_name("ACK6")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_ACK6")
	.dwattr $C$DW$183, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$183, DW_AT_decl_column(0x0b)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$184, DW_AT_name("ACK7")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_ACK7")
	.dwattr $C$DW$184, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$184, DW_AT_decl_column(0x0b)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$185, DW_AT_name("ACK8")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_ACK8")
	.dwattr $C$DW$185, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$185, DW_AT_decl_column(0x0b)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$186, DW_AT_name("ACK9")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_ACK9")
	.dwattr $C$DW$186, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$186, DW_AT_decl_column(0x0b)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$187, DW_AT_name("ACK10")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_ACK10")
	.dwattr $C$DW$187, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x50)
	.dwattr $C$DW$187, DW_AT_decl_column(0x0b)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$188, DW_AT_name("ACK11")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_ACK11")
	.dwattr $C$DW$188, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x51)
	.dwattr $C$DW$188, DW_AT_decl_column(0x0b)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$189, DW_AT_name("ACK12")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_ACK12")
	.dwattr $C$DW$189, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x52)
	.dwattr $C$DW$189, DW_AT_decl_column(0x0b)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$190, DW_AT_name("rsvd")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$190, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x53)
	.dwattr $C$DW$190, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x08)

$C$DW$T$23	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$23, DW_AT_name("PIEACK_REG")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$191, DW_AT_name("all")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x57)
	.dwattr $C$DW$191, DW_AT_decl_column(0x18)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$192, DW_AT_name("bit")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x58)
	.dwattr $C$DW$192, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x07)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$193, DW_AT_name("INTx1")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_INTx1")
	.dwattr $C$DW$193, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x23)
	.dwattr $C$DW$193, DW_AT_decl_column(0x0b)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$194, DW_AT_name("INTx2")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_INTx2")
	.dwattr $C$DW$194, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x24)
	.dwattr $C$DW$194, DW_AT_decl_column(0x0b)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$195, DW_AT_name("INTx3")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_INTx3")
	.dwattr $C$DW$195, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x25)
	.dwattr $C$DW$195, DW_AT_decl_column(0x0b)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$196, DW_AT_name("INTx4")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_INTx4")
	.dwattr $C$DW$196, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x26)
	.dwattr $C$DW$196, DW_AT_decl_column(0x0b)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$197, DW_AT_name("INTx5")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_INTx5")
	.dwattr $C$DW$197, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x27)
	.dwattr $C$DW$197, DW_AT_decl_column(0x0b)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$198, DW_AT_name("INTx6")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_INTx6")
	.dwattr $C$DW$198, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x28)
	.dwattr $C$DW$198, DW_AT_decl_column(0x0b)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$199, DW_AT_name("INTx7")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_INTx7")
	.dwattr $C$DW$199, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x29)
	.dwattr $C$DW$199, DW_AT_decl_column(0x0b)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$200, DW_AT_name("INTx8")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_INTx8")
	.dwattr $C$DW$200, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$200, DW_AT_decl_column(0x0b)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$201, DW_AT_name("rsvd")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$201, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x08)

$C$DW$T$25	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$202, DW_AT_name("all")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$202, DW_AT_decl_column(0x18)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$203, DW_AT_name("bit")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x30)
	.dwattr $C$DW$203, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x07)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$204, DW_AT_name("INTx1")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_INTx1")
	.dwattr $C$DW$204, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x35)
	.dwattr $C$DW$204, DW_AT_decl_column(0x0b)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$205, DW_AT_name("INTx2")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_INTx2")
	.dwattr $C$DW$205, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x36)
	.dwattr $C$DW$205, DW_AT_decl_column(0x0b)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$206, DW_AT_name("INTx3")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_INTx3")
	.dwattr $C$DW$206, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x37)
	.dwattr $C$DW$206, DW_AT_decl_column(0x0b)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$207, DW_AT_name("INTx4")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_INTx4")
	.dwattr $C$DW$207, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x38)
	.dwattr $C$DW$207, DW_AT_decl_column(0x0b)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$208, DW_AT_name("INTx5")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_INTx5")
	.dwattr $C$DW$208, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x39)
	.dwattr $C$DW$208, DW_AT_decl_column(0x0b)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$209, DW_AT_name("INTx6")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_INTx6")
	.dwattr $C$DW$209, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$209, DW_AT_decl_column(0x0b)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$210, DW_AT_name("INTx7")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_INTx7")
	.dwattr $C$DW$210, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$210, DW_AT_decl_column(0x0b)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$211, DW_AT_name("INTx8")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_INTx8")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$211, DW_AT_decl_column(0x0b)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$212, DW_AT_name("rsvd")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$212, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x08)

$C$DW$T$27	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$213, DW_AT_name("all")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x41)
	.dwattr $C$DW$213, DW_AT_decl_column(0x18)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$214, DW_AT_name("bit")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x42)
	.dwattr $C$DW$214, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x07)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$215, DW_AT_name("PIECTRL")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_PIECTRL")
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$215, DW_AT_decl_column(0x16)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$216, DW_AT_name("PIEACK")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_PIEACK")
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x60)
	.dwattr $C$DW$216, DW_AT_decl_column(0x16)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$217, DW_AT_name("PIEIER1")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_PIEIER1")
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x61)
	.dwattr $C$DW$217, DW_AT_decl_column(0x16)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$218, DW_AT_name("PIEIFR1")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_PIEIFR1")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x62)
	.dwattr $C$DW$218, DW_AT_decl_column(0x16)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$219, DW_AT_name("PIEIER2")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_PIEIER2")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x63)
	.dwattr $C$DW$219, DW_AT_decl_column(0x16)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$220, DW_AT_name("PIEIFR2")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_PIEIFR2")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x64)
	.dwattr $C$DW$220, DW_AT_decl_column(0x16)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$221, DW_AT_name("PIEIER3")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_PIEIER3")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x65)
	.dwattr $C$DW$221, DW_AT_decl_column(0x16)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$222, DW_AT_name("PIEIFR3")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_PIEIFR3")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x66)
	.dwattr $C$DW$222, DW_AT_decl_column(0x16)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$223, DW_AT_name("PIEIER4")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_PIEIER4")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x67)
	.dwattr $C$DW$223, DW_AT_decl_column(0x16)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$224, DW_AT_name("PIEIFR4")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_PIEIFR4")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x68)
	.dwattr $C$DW$224, DW_AT_decl_column(0x16)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$225, DW_AT_name("PIEIER5")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_PIEIER5")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x69)
	.dwattr $C$DW$225, DW_AT_decl_column(0x16)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$226, DW_AT_name("PIEIFR5")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_PIEIFR5")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$226, DW_AT_decl_column(0x16)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$227, DW_AT_name("PIEIER6")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_PIEIER6")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$227, DW_AT_decl_column(0x16)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$228, DW_AT_name("PIEIFR6")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_PIEIFR6")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$228, DW_AT_decl_column(0x16)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$229, DW_AT_name("PIEIER7")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_PIEIER7")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$229, DW_AT_decl_column(0x16)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$230, DW_AT_name("PIEIFR7")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_PIEIFR7")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$230, DW_AT_decl_column(0x16)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$231, DW_AT_name("PIEIER8")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_PIEIER8")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$231, DW_AT_decl_column(0x16)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$232, DW_AT_name("PIEIFR8")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_PIEIFR8")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x70)
	.dwattr $C$DW$232, DW_AT_decl_column(0x16)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$233, DW_AT_name("PIEIER9")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_PIEIER9")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x71)
	.dwattr $C$DW$233, DW_AT_decl_column(0x16)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$234, DW_AT_name("PIEIFR9")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_PIEIFR9")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x72)
	.dwattr $C$DW$234, DW_AT_decl_column(0x16)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$235, DW_AT_name("PIEIER10")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_PIEIER10")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x73)
	.dwattr $C$DW$235, DW_AT_decl_column(0x16)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$236, DW_AT_name("PIEIFR10")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_PIEIFR10")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x74)
	.dwattr $C$DW$236, DW_AT_decl_column(0x16)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$237, DW_AT_name("PIEIER11")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_PIEIER11")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x75)
	.dwattr $C$DW$237, DW_AT_decl_column(0x16)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$238, DW_AT_name("PIEIFR11")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_PIEIFR11")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x76)
	.dwattr $C$DW$238, DW_AT_decl_column(0x16)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$239, DW_AT_name("PIEIER12")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_PIEIER12")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x77)
	.dwattr $C$DW$239, DW_AT_decl_column(0x16)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$240, DW_AT_name("PIEIFR12")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_PIEIFR12")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x78)
	.dwattr $C$DW$240, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("..\include\DSP2803x_PieCtrl.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x08)
$C$DW$241	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$28)
$C$DW$T$505	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$505, DW_AT_type(*$C$DW$241)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("ADCCTL1_BITS")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$242, DW_AT_name("TEMPCONV")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_TEMPCONV")
	.dwattr $C$DW$242, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x18)
	.dwattr $C$DW$242, DW_AT_decl_column(0x0d)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$243, DW_AT_name("VREFLOCONV")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_VREFLOCONV")
	.dwattr $C$DW$243, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x19)
	.dwattr $C$DW$243, DW_AT_decl_column(0x0d)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$244, DW_AT_name("INTPULSEPOS")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_INTPULSEPOS")
	.dwattr $C$DW$244, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$244, DW_AT_decl_column(0x0d)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$245, DW_AT_name("ADCREFSEL")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_ADCREFSEL")
	.dwattr $C$DW$245, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$245, DW_AT_decl_column(0x0d)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$246, DW_AT_name("rsvd1")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$246, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$246, DW_AT_decl_column(0x0d)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$247, DW_AT_name("ADCREFPWD")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_ADCREFPWD")
	.dwattr $C$DW$247, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$247, DW_AT_decl_column(0x0d)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$248, DW_AT_name("ADCBGPWD")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_ADCBGPWD")
	.dwattr $C$DW$248, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$248, DW_AT_decl_column(0x0d)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$249, DW_AT_name("ADCPWDN")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_ADCPWDN")
	.dwattr $C$DW$249, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$249, DW_AT_decl_column(0x0d)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$250, DW_AT_name("ADCBSYCHN")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_ADCBSYCHN")
	.dwattr $C$DW$250, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x20)
	.dwattr $C$DW$250, DW_AT_decl_column(0x0d)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$251, DW_AT_name("ADCBSY")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_ADCBSY")
	.dwattr $C$DW$251, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x21)
	.dwattr $C$DW$251, DW_AT_decl_column(0x0d)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$252, DW_AT_name("ADCENABLE")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_ADCENABLE")
	.dwattr $C$DW$252, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x22)
	.dwattr $C$DW$252, DW_AT_decl_column(0x0d)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$253, DW_AT_name("RESET")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_RESET")
	.dwattr $C$DW$253, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x23)
	.dwattr $C$DW$253, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x17)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x08)

$C$DW$T$30	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$30, DW_AT_name("ADCCTL1_REG")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$254, DW_AT_name("all")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x28)
	.dwattr $C$DW$254, DW_AT_decl_column(0x1a)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$255, DW_AT_name("bit")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x29)
	.dwattr $C$DW$255, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x07)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_name("ADCCTL2_BITS")
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$256, DW_AT_name("CLKDIV2EN")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_CLKDIV2EN")
	.dwattr $C$DW$256, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$256, DW_AT_decl_column(0x0d)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$257, DW_AT_name("ADCNONOVERLAP")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_ADCNONOVERLAP")
	.dwattr $C$DW$257, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$257, DW_AT_decl_column(0x0d)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$258, DW_AT_name("rsvd1")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$258, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x30)
	.dwattr $C$DW$258, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x08)

$C$DW$T$32	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$32, DW_AT_name("ADCCTL2_REG")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$259, DW_AT_name("all")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x35)
	.dwattr $C$DW$259, DW_AT_decl_column(0x1a)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$260, DW_AT_name("bit")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x36)
	.dwattr $C$DW$260, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x07)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("ADCINT_BITS")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$261, DW_AT_name("ADCINT1")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_ADCINT1")
	.dwattr $C$DW$261, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$261, DW_AT_decl_column(0x0d)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$262, DW_AT_name("ADCINT2")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_ADCINT2")
	.dwattr $C$DW$262, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$262, DW_AT_decl_column(0x0d)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$263, DW_AT_name("ADCINT3")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_ADCINT3")
	.dwattr $C$DW$263, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$263, DW_AT_decl_column(0x0d)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$264, DW_AT_name("ADCINT4")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_ADCINT4")
	.dwattr $C$DW$264, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$264, DW_AT_decl_column(0x0d)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$265, DW_AT_name("ADCINT5")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_ADCINT5")
	.dwattr $C$DW$265, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$265, DW_AT_decl_column(0x0d)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$266, DW_AT_name("ADCINT6")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_ADCINT6")
	.dwattr $C$DW$266, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$266, DW_AT_decl_column(0x0d)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$267, DW_AT_name("ADCINT7")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_ADCINT7")
	.dwattr $C$DW$267, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x40)
	.dwattr $C$DW$267, DW_AT_decl_column(0x0d)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$268, DW_AT_name("ADCINT8")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_ADCINT8")
	.dwattr $C$DW$268, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x41)
	.dwattr $C$DW$268, DW_AT_decl_column(0x0d)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$269, DW_AT_name("ADCINT9")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_ADCINT9")
	.dwattr $C$DW$269, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x42)
	.dwattr $C$DW$269, DW_AT_decl_column(0x0d)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$270, DW_AT_name("rsvd1")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$270, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x43)
	.dwattr $C$DW$270, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x08)

$C$DW$T$34	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$34, DW_AT_name("ADCINT_REG")
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$271, DW_AT_name("all")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x47)
	.dwattr $C$DW$271, DW_AT_decl_column(0x1b)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$272, DW_AT_name("bit")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x48)
	.dwattr $C$DW$272, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x07)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("INTSEL1N2_BITS")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$273, DW_AT_name("INT1SEL")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_INT1SEL")
	.dwattr $C$DW$273, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$273, DW_AT_decl_column(0x0d)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$274, DW_AT_name("INT1E")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_INT1E")
	.dwattr $C$DW$274, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$274, DW_AT_decl_column(0x0d)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$275, DW_AT_name("INT1CONT")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_INT1CONT")
	.dwattr $C$DW$275, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$275, DW_AT_decl_column(0x0d)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$276, DW_AT_name("rsvd1")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$276, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$276, DW_AT_decl_column(0x0d)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$277, DW_AT_name("INT2SEL")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_INT2SEL")
	.dwattr $C$DW$277, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x50)
	.dwattr $C$DW$277, DW_AT_decl_column(0x0d)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$278, DW_AT_name("INT2E")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_INT2E")
	.dwattr $C$DW$278, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x51)
	.dwattr $C$DW$278, DW_AT_decl_column(0x0d)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$279, DW_AT_name("INT2CONT")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_INT2CONT")
	.dwattr $C$DW$279, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x52)
	.dwattr $C$DW$279, DW_AT_decl_column(0x0d)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$280, DW_AT_name("rsvd2")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$280, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x53)
	.dwattr $C$DW$280, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x08)

$C$DW$T$36	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$36, DW_AT_name("INTSEL1N2_REG")
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$281, DW_AT_name("all")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x57)
	.dwattr $C$DW$281, DW_AT_decl_column(0x1b)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$282, DW_AT_name("bit")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x58)
	.dwattr $C$DW$282, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$36

	.dwattr $C$DW$T$36, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x07)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("INTSEL3N4_BITS")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$283, DW_AT_name("INT3SEL")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_INT3SEL")
	.dwattr $C$DW$283, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$283, DW_AT_decl_column(0x0d)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$284, DW_AT_name("INT3E")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_INT3E")
	.dwattr $C$DW$284, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$284, DW_AT_decl_column(0x0d)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$285, DW_AT_name("INT3CONT")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_INT3CONT")
	.dwattr $C$DW$285, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$285, DW_AT_decl_column(0x0d)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$286, DW_AT_name("rsvd1")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$286, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x60)
	.dwattr $C$DW$286, DW_AT_decl_column(0x0d)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$287, DW_AT_name("INT4SEL")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_INT4SEL")
	.dwattr $C$DW$287, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x61)
	.dwattr $C$DW$287, DW_AT_decl_column(0x0d)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$288, DW_AT_name("INT4E")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_INT4E")
	.dwattr $C$DW$288, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x62)
	.dwattr $C$DW$288, DW_AT_decl_column(0x0d)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$289, DW_AT_name("INT4CONT")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_INT4CONT")
	.dwattr $C$DW$289, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x63)
	.dwattr $C$DW$289, DW_AT_decl_column(0x0d)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$290, DW_AT_name("rsvd2")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$290, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x64)
	.dwattr $C$DW$290, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x08)

$C$DW$T$38	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$38, DW_AT_name("INTSEL3N4_REG")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$291, DW_AT_name("all")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x68)
	.dwattr $C$DW$291, DW_AT_decl_column(0x1b)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$292, DW_AT_name("bit")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x69)
	.dwattr $C$DW$292, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$38

	.dwattr $C$DW$T$38, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x67)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x07)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("INTSEL5N6_BITS")
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$293, DW_AT_name("INT5SEL")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_INT5SEL")
	.dwattr $C$DW$293, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$293, DW_AT_decl_column(0x0d)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$294, DW_AT_name("INT5E")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_INT5E")
	.dwattr $C$DW$294, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$294, DW_AT_decl_column(0x0d)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$295, DW_AT_name("INT5CONT")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_INT5CONT")
	.dwattr $C$DW$295, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x70)
	.dwattr $C$DW$295, DW_AT_decl_column(0x0d)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$296, DW_AT_name("rsvd1")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$296, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x71)
	.dwattr $C$DW$296, DW_AT_decl_column(0x0d)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$297, DW_AT_name("INT6SEL")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_INT6SEL")
	.dwattr $C$DW$297, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x72)
	.dwattr $C$DW$297, DW_AT_decl_column(0x0d)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$298, DW_AT_name("INT6E")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_INT6E")
	.dwattr $C$DW$298, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x73)
	.dwattr $C$DW$298, DW_AT_decl_column(0x0d)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$299, DW_AT_name("INT6CONT")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_INT6CONT")
	.dwattr $C$DW$299, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x74)
	.dwattr $C$DW$299, DW_AT_decl_column(0x0d)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$300, DW_AT_name("rsvd2")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$300, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x75)
	.dwattr $C$DW$300, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$39

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x08)

$C$DW$T$40	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$40, DW_AT_name("INTSEL5N6_REG")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$301, DW_AT_name("all")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x79)
	.dwattr $C$DW$301, DW_AT_decl_column(0x1b)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$302, DW_AT_name("bit")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$302, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$40

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x78)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x07)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("INTSEL7N8_BITS")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$303, DW_AT_name("INT7SEL")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_INT7SEL")
	.dwattr $C$DW$303, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$303, DW_AT_decl_column(0x0d)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$304, DW_AT_name("INT7E")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_INT7E")
	.dwattr $C$DW$304, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x80)
	.dwattr $C$DW$304, DW_AT_decl_column(0x0d)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$305, DW_AT_name("INT7CONT")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_INT7CONT")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x81)
	.dwattr $C$DW$305, DW_AT_decl_column(0x0d)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$306, DW_AT_name("rsvd1")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$306, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x82)
	.dwattr $C$DW$306, DW_AT_decl_column(0x0d)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$307, DW_AT_name("INT8SEL")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_INT8SEL")
	.dwattr $C$DW$307, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x83)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0d)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$308, DW_AT_name("INT8E")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_INT8E")
	.dwattr $C$DW$308, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x84)
	.dwattr $C$DW$308, DW_AT_decl_column(0x0d)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$309, DW_AT_name("INT8CONT")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_INT8CONT")
	.dwattr $C$DW$309, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x85)
	.dwattr $C$DW$309, DW_AT_decl_column(0x0d)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$310, DW_AT_name("rsvd2")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$310, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x86)
	.dwattr $C$DW$310, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x08)

$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_name("INTSEL7N8_REG")
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$311, DW_AT_name("all")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$311, DW_AT_decl_column(0x1b)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$312, DW_AT_name("bit")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$312, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x89)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x07)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("INTSEL9N10_BITS")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$313, DW_AT_name("INT9SEL")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_INT9SEL")
	.dwattr $C$DW$313, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x90)
	.dwattr $C$DW$313, DW_AT_decl_column(0x0d)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$314, DW_AT_name("INT9E")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_INT9E")
	.dwattr $C$DW$314, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x91)
	.dwattr $C$DW$314, DW_AT_decl_column(0x0d)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$315, DW_AT_name("INT9CONT")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_INT9CONT")
	.dwattr $C$DW$315, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x92)
	.dwattr $C$DW$315, DW_AT_decl_column(0x0d)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$316, DW_AT_name("rsvd1")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$316, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x93)
	.dwattr $C$DW$316, DW_AT_decl_column(0x0d)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$317, DW_AT_name("INT10SEL")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_INT10SEL")
	.dwattr $C$DW$317, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x94)
	.dwattr $C$DW$317, DW_AT_decl_column(0x0d)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$318, DW_AT_name("INT10E")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_INT10E")
	.dwattr $C$DW$318, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x95)
	.dwattr $C$DW$318, DW_AT_decl_column(0x0d)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$319, DW_AT_name("INT10CONT")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_INT10CONT")
	.dwattr $C$DW$319, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x96)
	.dwattr $C$DW$319, DW_AT_decl_column(0x0d)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$320, DW_AT_name("rsvd2")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$320, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x97)
	.dwattr $C$DW$320, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$43

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x08)

$C$DW$T$44	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$44, DW_AT_name("INTSEL9N10_REG")
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$321, DW_AT_name("all")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$321, DW_AT_decl_column(0x1b)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$322, DW_AT_name("bit")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$322, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$44

	.dwattr $C$DW$T$44, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x07)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("SOCPRICTL_BITS")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$323, DW_AT_name("SOCPRIORITY")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_SOCPRIORITY")
	.dwattr $C$DW$323, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$323, DW_AT_decl_column(0x0d)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$324, DW_AT_name("RRPOINTER")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_RRPOINTER")
	.dwattr $C$DW$324, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x06)
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$324, DW_AT_decl_column(0x0d)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$325, DW_AT_name("rsvd1")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$325, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x04)
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$325, DW_AT_decl_column(0x0d)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$326, DW_AT_name("ONESHOT")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_ONESHOT")
	.dwattr $C$DW$326, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$326, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$45

	.dwattr $C$DW$T$45, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x08)

$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_name("SOCPRICTL_REG")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$327, DW_AT_name("all")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$327, DW_AT_decl_column(0x1c)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$328, DW_AT_name("bit")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$328, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$46

	.dwattr $C$DW$T$46, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x07)

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_name("ADCSAMPLEMODE_BITS")
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$329, DW_AT_name("SIMULEN0")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_SIMULEN0")
	.dwattr $C$DW$329, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0xac)
	.dwattr $C$DW$329, DW_AT_decl_column(0x0c)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$330, DW_AT_name("SIMULEN2")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_SIMULEN2")
	.dwattr $C$DW$330, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0xad)
	.dwattr $C$DW$330, DW_AT_decl_column(0x0c)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$331, DW_AT_name("SIMULEN4")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_SIMULEN4")
	.dwattr $C$DW$331, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0xae)
	.dwattr $C$DW$331, DW_AT_decl_column(0x0c)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$332, DW_AT_name("SIMULEN6")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_SIMULEN6")
	.dwattr $C$DW$332, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$332, DW_AT_decl_column(0x0c)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$333, DW_AT_name("SIMULEN8")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_SIMULEN8")
	.dwattr $C$DW$333, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$333, DW_AT_decl_column(0x0c)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$334, DW_AT_name("SIMULEN10")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_SIMULEN10")
	.dwattr $C$DW$334, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$334, DW_AT_decl_column(0x0c)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$335, DW_AT_name("SIMULEN12")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_SIMULEN12")
	.dwattr $C$DW$335, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$335, DW_AT_decl_column(0x0c)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$336, DW_AT_name("SIMULEN14")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_SIMULEN14")
	.dwattr $C$DW$336, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$336, DW_AT_decl_column(0x0c)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$337, DW_AT_name("rsvd1")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$337, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$337, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$47

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0xab)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x08)

$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_name("ADCSAMPLEMODE_REG")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$338, DW_AT_name("all")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$338, DW_AT_decl_column(0x21)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$339, DW_AT_name("bit")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$339, DW_AT_decl_column(0x21)
	.dwendtag $C$DW$T$48

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x07)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("ADCINTSOCSEL1_BITS")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$340, DW_AT_name("SOC0")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_SOC0")
	.dwattr $C$DW$340, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$340, DW_AT_decl_column(0x0c)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$341, DW_AT_name("SOC1")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_SOC1")
	.dwattr $C$DW$341, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$341, DW_AT_decl_column(0x0c)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$342, DW_AT_name("SOC2")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_SOC2")
	.dwattr $C$DW$342, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$342, DW_AT_decl_column(0x0c)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$343, DW_AT_name("SOC3")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_SOC3")
	.dwattr $C$DW$343, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("..\include\DSP2803x_Adc.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$343, DW_AT_decl_column(0x0c)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$344, DW_AT_name("SOC4")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_SOC4")
