;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
;* Date/Time created: Wed Jul 24 10:05:51 2019                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("Ev72main.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Drive0X\trunk\16-PEU11C33\03-C33M07-ABS\app\source")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("InitPieCtrl")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_InitPieCtrl")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../include/SysCtrl.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x12)
	.dwattr $C$DW$1, DW_AT_decl_column(0x16)

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("DisableDog")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_DisableDog")
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external
	.dwattr $C$DW$2, DW_AT_decl_file("../include/SysCtrl.h")
	.dwattr $C$DW$2, DW_AT_decl_line(0x13)
	.dwattr $C$DW$2, DW_AT_decl_column(0x16)

$C$DW$3	.dwtag  DW_TAG_subprogram, DW_AT_name("InitGpio")

	.dwattr $C$DW$T$481, DW_AT_decl_column(0x19)
$C$DW$T$486	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$486, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$486, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$486, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$486, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$486, DW_AT_decl_column(0x19)
$C$DW$T$665	.dwtag  DW_TAG_typedef, DW_AT_name("UdsTp_NPduTxSTmin_t")
	.dwattr $C$DW$T$665, DW_AT_type(*$C$DW$T$486)
	.dwattr $C$DW$T$665, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$665, DW_AT_decl_file("..\include\udstp_priv.h")
	.dwattr $C$DW$T$665, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$665, DW_AT_decl_column(0x15)
$C$DW$T$752	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$752, DW_AT_type(*$C$DW$T$486)
	.dwattr $C$DW$T$752, DW_AT_address_class(0x16)
$C$DW$T$865	.dwtag  DW_TAG_typedef, DW_AT_name("Uds_StatePtr32")
	.dwattr $C$DW$T$865, DW_AT_type(*$C$DW$T$752)
	.dwattr $C$DW$T$865, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$865, DW_AT_decl_file("..\include\uds_target.h")
	.dwattr $C$DW$T$865, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$865, DW_AT_decl_column(0x2b)
$C$DW$316	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$486)
$C$DW$T$866	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$866, DW_AT_type(*$C$DW$316)
$C$DW$T$867	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$867, DW_AT_type(*$C$DW$T$866)
	.dwattr $C$DW$T$867, DW_AT_address_class(0x16)
$C$DW$T$868	.dwtag  DW_TAG_typedef, DW_AT_name("Uds_CfgPtr32")
	.dwattr $C$DW$T$868, DW_AT_type(*$C$DW$T$867)
	.dwattr $C$DW$T$868, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$868, DW_AT_decl_file("..\include\uds_target.h")
	.dwattr $C$DW$T$868, DW_AT_decl_line(0x87)
	.dwattr $C$DW$T$868, DW_AT_decl_column(0x26)
$C$DW$T$565	.dwtag  DW_TAG_typedef, DW_AT_name("uint32")
	.dwattr $C$DW$T$565, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$565, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$565, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$565, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$565, DW_AT_decl_column(0x19)

$C$DW$T$597	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$597, DW_AT_byte_size(0x08)
$C$DW$317	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$317, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$597

$C$DW$T$869	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$869, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$869, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$869, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$869, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$869, DW_AT_decl_column(0x1b)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$870	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$870, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$870, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$870, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$870, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$870, DW_AT_decl_column(0x1a)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$871	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$871, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$871, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$871, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$871, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$871, DW_AT_decl_column(0x1d)
$C$DW$T$872	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$872, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$872, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$872, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$872, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$872, DW_AT_decl_column(0x1e)
$C$DW$T$873	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$873, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$873, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$873, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$873, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$873, DW_AT_decl_column(0x1e)
$C$DW$T$874	.dwtag  DW_TAG_typedef, DW_AT_name("QWORD")
	.dwattr $C$DW$T$874, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$874, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$874, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$874, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$874, DW_AT_decl_column(0x1e)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$875	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$875, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$875, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$875, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$875, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$875, DW_AT_decl_column(0x1a)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$876	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$876, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$876, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$876, DW_AT_decl_file("../include/Typedefs.h")
	.dwattr $C$DW$T$876, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$876, DW_AT_decl_column(0x1a)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("TBCTL_BITS")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$318, DW_AT_name("CTRMODE")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_CTRMODE")
	.dwattr $C$DW$318, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x17)
	.dwattr $C$DW$318, DW_AT_decl_column(0x0b)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$319, DW_AT_name("PHSEN")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_PHSEN")
	.dwattr $C$DW$319, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x18)
	.dwattr $C$DW$319, DW_AT_decl_column(0x0b)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$320, DW_AT_name("PRDLD")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_PRDLD")
	.dwattr $C$DW$320, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x19)
	.dwattr $C$DW$320, DW_AT_decl_column(0x0b)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$321, DW_AT_name("SYNCOSEL")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_SYNCOSEL")
	.dwattr $C$DW$321, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$321, DW_AT_decl_column(0x0b)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$322, DW_AT_name("SWFSYNC")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_SWFSYNC")
	.dwattr $C$DW$322, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$322, DW_AT_decl_column(0x0b)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$323, DW_AT_name("HSPCLKDIV")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_HSPCLKDIV")
	.dwattr $C$DW$323, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x03)
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$323, DW_AT_decl_column(0x0b)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$324, DW_AT_name("CLKDIV")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_CLKDIV")
	.dwattr $C$DW$324, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x03)
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$324, DW_AT_decl_column(0x0b)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$325, DW_AT_name("PHSDIR")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_PHSDIR")
	.dwattr $C$DW$325, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$325, DW_AT_decl_column(0x0b)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$326, DW_AT_name("FREE_SOFT")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_FREE_SOFT")
	.dwattr $C$DW$326, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$326, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x16)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x08)

$C$DW$T$21	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$21, DW_AT_name("TBCTL_REG")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$327, DW_AT_name("all")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x23)
	.dwattr $C$DW$327, DW_AT_decl_column(0x18)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$328, DW_AT_name("bit")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x24)
	.dwattr $C$DW$328, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x07)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("TBSTS_BITS")
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$329, DW_AT_name("CTRDIR")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_CTRDIR")
	.dwattr $C$DW$329, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$329, DW_AT_decl_column(0x0b)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$330, DW_AT_name("SYNCI")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_SYNCI")
	.dwattr $C$DW$330, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$330, DW_AT_decl_column(0x0b)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$331, DW_AT_name("CTRMAX")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_CTRMAX")
	.dwattr $C$DW$331, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$331, DW_AT_decl_column(0x0b)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$332, DW_AT_name("rsvd1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$332, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$332, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x08)

$C$DW$T$23	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$23, DW_AT_name("TBSTS_REG")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$333, DW_AT_name("all")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x31)
	.dwattr $C$DW$333, DW_AT_decl_column(0x18)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$334, DW_AT_name("bit")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x32)
	.dwattr $C$DW$334, DW_AT_decl_column(0x18)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x07)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("TBPHS_HRPWM_REG")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$335, DW_AT_name("TBPHSHR")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_TBPHSHR")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x1d5)
	.dwattr $C$DW$335, DW_AT_decl_column(0x0c)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$336, DW_AT_name("TBPHS")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_TBPHS")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x1d6)
	.dwattr $C$DW$336, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x1d4)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x08)

$C$DW$T$26	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$26, DW_AT_name("TBPHS_HRPWM_GROUP")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$337, DW_AT_name("all")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x1da)
	.dwattr $C$DW$337, DW_AT_decl_column(0x1c)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$338, DW_AT_name("half")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_half")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x1db)
	.dwattr $C$DW$338, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x1d9)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x07)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("CMPCTL_BITS")
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$339, DW_AT_name("LOADAMODE")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_LOADAMODE")
	.dwattr $C$DW$339, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x38)
	.dwattr $C$DW$339, DW_AT_decl_column(0x0b)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$340, DW_AT_name("LOADBMODE")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_LOADBMODE")
	.dwattr $C$DW$340, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x39)
	.dwattr $C$DW$340, DW_AT_decl_column(0x0b)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$341, DW_AT_name("SHDWAMODE")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_SHDWAMODE")
	.dwattr $C$DW$341, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$341, DW_AT_decl_column(0x0b)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$342, DW_AT_name("rsvd1")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$342, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$342, DW_AT_decl_column(0x0b)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$343, DW_AT_name("SHDWBMODE")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_SHDWBMODE")
	.dwattr $C$DW$343, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$343, DW_AT_decl_column(0x0b)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$344, DW_AT_name("rsvd2")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$344, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$344, DW_AT_decl_column(0x0b)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$345, DW_AT_name("SHDWAFULL")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_SHDWAFULL")
	.dwattr $C$DW$345, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$345, DW_AT_decl_column(0x0b)
$C$DW$346	.dwtag  DW_TAG_member
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$346, DW_AT_name("SHDWBFULL")
	.dwattr $C$DW$346, DW_AT_TI_symbol_name("_SHDWBFULL")
	.dwattr $C$DW$346, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$346, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$346, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$346, DW_AT_decl_column(0x0b)
$C$DW$347	.dwtag  DW_TAG_member
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$347, DW_AT_name("rsvd3")
	.dwattr $C$DW$347, DW_AT_TI_symbol_name("_rsvd3")
	.dwattr $C$DW$347, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
	.dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$347, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$347, DW_AT_decl_line(0x40)
	.dwattr $C$DW$347, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x08)

$C$DW$T$28	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$28, DW_AT_name("CMPCTL_REG")
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
$C$DW$348	.dwtag  DW_TAG_member
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$348, DW_AT_name("all")
	.dwattr $C$DW$348, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$348, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$348, DW_AT_decl_line(0x45)
	.dwattr $C$DW$348, DW_AT_decl_column(0x1a)
$C$DW$349	.dwtag  DW_TAG_member
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$349, DW_AT_name("bit")
	.dwattr $C$DW$349, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$349, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$349, DW_AT_decl_line(0x46)
	.dwattr $C$DW$349, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x07)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("CMPA_HRPWM_REG")
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$350, DW_AT_name("CMPAHR")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_CMPAHR")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x1df)
	.dwattr $C$DW$350, DW_AT_decl_column(0x0c)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$351, DW_AT_name("CMPA")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_CMPA")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x1e0)
	.dwattr $C$DW$351, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x1de)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x08)

$C$DW$T$30	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$30, DW_AT_name("CMPA_HRPWM_GROUP")
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$352, DW_AT_name("all")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x1e4)
	.dwattr $C$DW$352, DW_AT_decl_column(0x1b)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$353, DW_AT_name("half")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_half")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x1e5)
	.dwattr $C$DW$353, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x1e3)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x07)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_name("AQCTL_BITS")
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$354, DW_AT_name("ZRO")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_ZRO")
	.dwattr $C$DW$354, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$354, DW_AT_decl_column(0x0b)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$355, DW_AT_name("PRD")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_PRD")
	.dwattr $C$DW$355, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$355, DW_AT_decl_column(0x0b)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$356, DW_AT_name("CAU")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_CAU")
	.dwattr $C$DW$356, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$356, DW_AT_decl_column(0x0b)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$357, DW_AT_name("CAD")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_CAD")
	.dwattr $C$DW$357, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$357, DW_AT_decl_column(0x0b)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$358, DW_AT_name("CBU")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_CBU")
	.dwattr $C$DW$358, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x50)
	.dwattr $C$DW$358, DW_AT_decl_column(0x0b)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$359, DW_AT_name("CBD")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_CBD")
	.dwattr $C$DW$359, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x51)
	.dwattr $C$DW$359, DW_AT_decl_column(0x0b)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$360, DW_AT_name("rsvd")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$360, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x52)
	.dwattr $C$DW$360, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x08)

$C$DW$T$32	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$32, DW_AT_name("AQCTL_REG")
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$361, DW_AT_name("all")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x56)
	.dwattr $C$DW$361, DW_AT_decl_column(0x1a)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$362, DW_AT_name("bit")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x57)
	.dwattr $C$DW$362, DW_AT_decl_column(0x1a)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x07)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("AQSFRC_BITS")
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$363, DW_AT_name("ACTSFA")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_ACTSFA")
	.dwattr $C$DW$363, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$363, DW_AT_decl_column(0x0b)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$364, DW_AT_name("OTSFA")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_OTSFA")
	.dwattr $C$DW$364, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$364, DW_AT_decl_column(0x0b)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$365, DW_AT_name("ACTSFB")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_ACTSFB")
	.dwattr $C$DW$365, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$365, DW_AT_decl_column(0x0b)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$366, DW_AT_name("OTSFB")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_OTSFB")
	.dwattr $C$DW$366, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x60)
	.dwattr $C$DW$366, DW_AT_decl_column(0x0b)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$367, DW_AT_name("RLDCSF")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_RLDCSF")
	.dwattr $C$DW$367, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x61)
	.dwattr $C$DW$367, DW_AT_decl_column(0x0b)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$368, DW_AT_name("rsvd1")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$368, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x62)
	.dwattr $C$DW$368, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x08)

$C$DW$T$34	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$34, DW_AT_name("AQSFRC_REG")
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$369, DW_AT_name("all")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x66)
	.dwattr $C$DW$369, DW_AT_decl_column(0x1b)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$370, DW_AT_name("bit")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x67)
	.dwattr $C$DW$370, DW_AT_decl_column(0x1b)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x65)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x07)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("AQCSFRC_BITS")
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$371, DW_AT_name("CSFA")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_CSFA")
	.dwattr $C$DW$371, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$371, DW_AT_decl_column(0x0b)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$372, DW_AT_name("CSFB")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_CSFB")
	.dwattr $C$DW$372, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$372, DW_AT_decl_column(0x0b)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$373, DW_AT_name("rsvd1")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$373, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$373, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x08)

$C$DW$T$36	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$36, DW_AT_name("AQCSFRC_REG")
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$374, DW_AT_name("all")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x73)
	.dwattr $C$DW$374, DW_AT_decl_column(0x1c)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$375, DW_AT_name("bit")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x74)
	.dwattr $C$DW$375, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$36

	.dwattr $C$DW$T$36, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x72)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x07)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("DBCTL_BITS")
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$376, DW_AT_name("OUT_MODE")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_OUT_MODE")
	.dwattr $C$DW$376, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$376, DW_AT_decl_column(0x0b)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$377, DW_AT_name("POLSEL")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_POLSEL")
	.dwattr $C$DW$377, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$377, DW_AT_decl_column(0x0b)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$378, DW_AT_name("IN_MODE")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_IN_MODE")
	.dwattr $C$DW$378, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$378, DW_AT_decl_column(0x0b)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$379, DW_AT_name("rsvd1")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$379, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x09)
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$379, DW_AT_decl_column(0x0b)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$380, DW_AT_name("HALFCYCLE")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_HALFCYCLE")
	.dwattr $C$DW$380, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$380, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x08)

$C$DW$T$38	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$38, DW_AT_name("DBCTL_REG")
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$381, DW_AT_name("all")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x83)
	.dwattr $C$DW$381, DW_AT_decl_column(0x1c)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$382, DW_AT_name("bit")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x84)
	.dwattr $C$DW$382, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$38

	.dwattr $C$DW$T$38, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x07)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("TZSEL_BITS")
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$383, DW_AT_name("CBC1")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_CBC1")
	.dwattr $C$DW$383, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$383, DW_AT_decl_column(0x0c)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$384, DW_AT_name("CBC2")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_CBC2")
	.dwattr $C$DW$384, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$384, DW_AT_decl_column(0x0c)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$385, DW_AT_name("CBC3")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_CBC3")
	.dwattr $C$DW$385, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$385, DW_AT_decl_column(0x0c)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$386, DW_AT_name("CBC4")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_CBC4")
	.dwattr $C$DW$386, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$386, DW_AT_decl_column(0x0c)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$387, DW_AT_name("CBC5")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_CBC5")
	.dwattr $C$DW$387, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$387, DW_AT_decl_column(0x0c)
$C$DW$388	.dwtag  DW_TAG_member
	.dwattr $C$DW$388, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$388, DW_AT_name("CBC6")
	.dwattr $C$DW$388, DW_AT_TI_symbol_name("_CBC6")
	.dwattr $C$DW$388, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$388, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$388, DW_AT_decl_line(0x90)
	.dwattr $C$DW$388, DW_AT_decl_column(0x0c)
$C$DW$389	.dwtag  DW_TAG_member
	.dwattr $C$DW$389, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$389, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$389, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$389, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$389, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$389, DW_AT_decl_line(0x91)
	.dwattr $C$DW$389, DW_AT_decl_column(0x0c)
$C$DW$390	.dwtag  DW_TAG_member
	.dwattr $C$DW$390, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$390, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$390, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$390, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$390, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$390, DW_AT_decl_line(0x92)
	.dwattr $C$DW$390, DW_AT_decl_column(0x0c)
$C$DW$391	.dwtag  DW_TAG_member
	.dwattr $C$DW$391, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$391, DW_AT_name("OSHT1")
	.dwattr $C$DW$391, DW_AT_TI_symbol_name("_OSHT1")
	.dwattr $C$DW$391, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$391, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$391, DW_AT_decl_line(0x93)
	.dwattr $C$DW$391, DW_AT_decl_column(0x0c)
$C$DW$392	.dwtag  DW_TAG_member
	.dwattr $C$DW$392, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$392, DW_AT_name("OSHT2")
	.dwattr $C$DW$392, DW_AT_TI_symbol_name("_OSHT2")
	.dwattr $C$DW$392, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$392, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$392, DW_AT_decl_line(0x94)
	.dwattr $C$DW$392, DW_AT_decl_column(0x0c)
$C$DW$393	.dwtag  DW_TAG_member
	.dwattr $C$DW$393, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$393, DW_AT_name("OSHT3")
	.dwattr $C$DW$393, DW_AT_TI_symbol_name("_OSHT3")
	.dwattr $C$DW$393, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$393, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$393, DW_AT_decl_line(0x95)
	.dwattr $C$DW$393, DW_AT_decl_column(0x0c)
$C$DW$394	.dwtag  DW_TAG_member
	.dwattr $C$DW$394, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$394, DW_AT_name("OSHT4")
	.dwattr $C$DW$394, DW_AT_TI_symbol_name("_OSHT4")
	.dwattr $C$DW$394, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$394, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$394, DW_AT_decl_line(0x96)
	.dwattr $C$DW$394, DW_AT_decl_column(0x0c)
$C$DW$395	.dwtag  DW_TAG_member
	.dwattr $C$DW$395, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$395, DW_AT_name("OSHT5")
	.dwattr $C$DW$395, DW_AT_TI_symbol_name("_OSHT5")
	.dwattr $C$DW$395, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$395, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$395, DW_AT_decl_line(0x97)
	.dwattr $C$DW$395, DW_AT_decl_column(0x0c)
$C$DW$396	.dwtag  DW_TAG_member
	.dwattr $C$DW$396, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$396, DW_AT_name("OSHT6")
	.dwattr $C$DW$396, DW_AT_TI_symbol_name("_OSHT6")
	.dwattr $C$DW$396, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$396, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$396, DW_AT_decl_line(0x98)
	.dwattr $C$DW$396, DW_AT_decl_column(0x0c)
$C$DW$397	.dwtag  DW_TAG_member
	.dwattr $C$DW$397, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$397, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$397, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$397, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$397, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$397, DW_AT_decl_line(0x99)
	.dwattr $C$DW$397, DW_AT_decl_column(0x0c)
$C$DW$398	.dwtag  DW_TAG_member
	.dwattr $C$DW$398, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$398, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$398, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$398, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$398, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$398, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$398, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$39

	.dwattr $C$DW$T$39, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x08)

$C$DW$T$40	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$40, DW_AT_name("TZSEL_REG")
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$399	.dwtag  DW_TAG_member
	.dwattr $C$DW$399, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$399, DW_AT_name("all")
	.dwattr $C$DW$399, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$399, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$399, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$399, DW_AT_decl_column(0x1c)
$C$DW$400	.dwtag  DW_TAG_member
	.dwattr $C$DW$400, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$400, DW_AT_name("bit")
	.dwattr $C$DW$400, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$400, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$400, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$400, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$40

	.dwattr $C$DW$T$40, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x07)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("TZDCSEL_BITS")
	.dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
$C$DW$401	.dwtag  DW_TAG_member
	.dwattr $C$DW$401, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$401, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$401, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$401, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
	.dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$401, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$401, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$401, DW_AT_decl_column(0x0c)
$C$DW$402	.dwtag  DW_TAG_member
	.dwattr $C$DW$402, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$402, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$402, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$402, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x03)
	.dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$402, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$402, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$402, DW_AT_decl_column(0x0c)
$C$DW$403	.dwtag  DW_TAG_member
	.dwattr $C$DW$403, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$403, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$403, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$403, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x03)
	.dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$403, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$403, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$403, DW_AT_decl_column(0x0c)
$C$DW$404	.dwtag  DW_TAG_member
	.dwattr $C$DW$404, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$404, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$404, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$404, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x03)
	.dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$404, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$404, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$404, DW_AT_decl_column(0x0c)
$C$DW$405	.dwtag  DW_TAG_member
	.dwattr $C$DW$405, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$405, DW_AT_name("rsvd1")
	.dwattr $C$DW$405, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$405, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$405, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$405, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$405, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x08)

$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_name("TZDCSEL_REG")
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$406	.dwtag  DW_TAG_member
	.dwattr $C$DW$406, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$406, DW_AT_name("all")
	.dwattr $C$DW$406, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$406, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$406, DW_AT_decl_line(0xae)
	.dwattr $C$DW$406, DW_AT_decl_column(0x1c)
$C$DW$407	.dwtag  DW_TAG_member
	.dwattr $C$DW$407, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$407, DW_AT_name("bit")
	.dwattr $C$DW$407, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$407, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$407, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$407, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0xad)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x07)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("TZCTL_BITS")
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
$C$DW$408	.dwtag  DW_TAG_member
	.dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$408, DW_AT_name("TZA")
	.dwattr $C$DW$408, DW_AT_TI_symbol_name("_TZA")
	.dwattr $C$DW$408, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$408, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$408, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$408, DW_AT_decl_column(0x0b)
$C$DW$409	.dwtag  DW_TAG_member
	.dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$409, DW_AT_name("TZB")
	.dwattr $C$DW$409, DW_AT_TI_symbol_name("_TZB")
	.dwattr $C$DW$409, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$409, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$409, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$409, DW_AT_decl_column(0x0b)
$C$DW$410	.dwtag  DW_TAG_member
	.dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$410, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$410, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$410, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$410, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$410, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$410, DW_AT_decl_column(0x0b)
$C$DW$411	.dwtag  DW_TAG_member
	.dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$411, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$411, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$411, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
	.dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$411, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$411, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$411, DW_AT_decl_column(0x0b)
$C$DW$412	.dwtag  DW_TAG_member
	.dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$412, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$412, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$412, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
	.dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$412, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$412, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$412, DW_AT_decl_column(0x0b)
$C$DW$413	.dwtag  DW_TAG_member
	.dwattr $C$DW$413, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$413, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$413, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$413, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
	.dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$413, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$413, DW_AT_decl_line(0xba)
	.dwattr $C$DW$413, DW_AT_decl_column(0x0b)
$C$DW$414	.dwtag  DW_TAG_member
	.dwattr $C$DW$414, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$414, DW_AT_name("rsvd")
	.dwattr $C$DW$414, DW_AT_TI_symbol_name("_rsvd")
	.dwattr $C$DW$414, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
	.dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$414, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$414, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$414, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$43

	.dwattr $C$DW$T$43, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x08)

$C$DW$T$44	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$44, DW_AT_name("TZCTL_REG")
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
$C$DW$415	.dwtag  DW_TAG_member
	.dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$415, DW_AT_name("all")
	.dwattr $C$DW$415, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$415, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$415, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$415, DW_AT_decl_column(0x1c)
$C$DW$416	.dwtag  DW_TAG_member
	.dwattr $C$DW$416, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$416, DW_AT_name("bit")
	.dwattr $C$DW$416, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$416, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$416, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$416, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$44

	.dwattr $C$DW$T$44, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x07)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("TZEINT_BITS")
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
$C$DW$417	.dwtag  DW_TAG_member
	.dwattr $C$DW$417, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$417, DW_AT_name("rsvd1")
	.dwattr $C$DW$417, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$417, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$417, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$417, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$417, DW_AT_decl_column(0x0c)
$C$DW$418	.dwtag  DW_TAG_member
	.dwattr $C$DW$418, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$418, DW_AT_name("CBC")
	.dwattr $C$DW$418, DW_AT_TI_symbol_name("_CBC")
	.dwattr $C$DW$418, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$418, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$418, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$418, DW_AT_decl_column(0x0c)
$C$DW$419	.dwtag  DW_TAG_member
	.dwattr $C$DW$419, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$419, DW_AT_name("OST")
	.dwattr $C$DW$419, DW_AT_TI_symbol_name("_OST")
	.dwattr $C$DW$419, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$419, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$419, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$419, DW_AT_decl_column(0x0c)
$C$DW$420	.dwtag  DW_TAG_member
	.dwattr $C$DW$420, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$420, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$420, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$420, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$420, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$420, DW_AT_decl_line(0xca)
	.dwattr $C$DW$420, DW_AT_decl_column(0x0c)
$C$DW$421	.dwtag  DW_TAG_member
	.dwattr $C$DW$421, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$421, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$421, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$421, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$421, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$421, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$421, DW_AT_decl_column(0x0c)
$C$DW$422	.dwtag  DW_TAG_member
	.dwattr $C$DW$422, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$422, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$422, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$422, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$422, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$422, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$422, DW_AT_decl_column(0x0c)
$C$DW$423	.dwtag  DW_TAG_member
	.dwattr $C$DW$423, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$423, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$423, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$423, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$423, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$423, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$423, DW_AT_decl_column(0x0c)
$C$DW$424	.dwtag  DW_TAG_member
	.dwattr $C$DW$424, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$424, DW_AT_name("rsvd2")
	.dwattr $C$DW$424, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$424, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
	.dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$424, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$424, DW_AT_decl_line(0xce)
	.dwattr $C$DW$424, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$45

	.dwattr $C$DW$T$45, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x08)

$C$DW$T$46	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$46, DW_AT_name("TZEINT_REG")
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
$C$DW$425	.dwtag  DW_TAG_member
	.dwattr $C$DW$425, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$425, DW_AT_name("all")
	.dwattr $C$DW$425, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$425, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$425, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$425, DW_AT_decl_column(0x1c)
$C$DW$426	.dwtag  DW_TAG_member
	.dwattr $C$DW$426, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$426, DW_AT_name("bit")
	.dwattr $C$DW$426, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$426, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$426, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$426, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$46

	.dwattr $C$DW$T$46, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x07)

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_name("TZFLG_BITS")
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
$C$DW$427	.dwtag  DW_TAG_member
	.dwattr $C$DW$427, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$427, DW_AT_name("INT")
	.dwattr $C$DW$427, DW_AT_TI_symbol_name("_INT")
	.dwattr $C$DW$427, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$427, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$427, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$427, DW_AT_decl_column(0x0c)
$C$DW$428	.dwtag  DW_TAG_member
	.dwattr $C$DW$428, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$428, DW_AT_name("CBC")
	.dwattr $C$DW$428, DW_AT_TI_symbol_name("_CBC")
	.dwattr $C$DW$428, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$428, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$428, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$428, DW_AT_decl_column(0x0c)
$C$DW$429	.dwtag  DW_TAG_member
	.dwattr $C$DW$429, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$429, DW_AT_name("OST")
	.dwattr $C$DW$429, DW_AT_TI_symbol_name("_OST")
	.dwattr $C$DW$429, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$429, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$429, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$429, DW_AT_decl_column(0x0c)
$C$DW$430	.dwtag  DW_TAG_member
	.dwattr $C$DW$430, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$430, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$430, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$430, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$430, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$430, DW_AT_decl_line(0xde)
	.dwattr $C$DW$430, DW_AT_decl_column(0x0c)
$C$DW$431	.dwtag  DW_TAG_member
	.dwattr $C$DW$431, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$431, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$431, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$431, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$431, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$431, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$431, DW_AT_decl_column(0x0c)
$C$DW$432	.dwtag  DW_TAG_member
	.dwattr $C$DW$432, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$432, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$432, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$432, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$432, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$432, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$432, DW_AT_decl_column(0x0c)
$C$DW$433	.dwtag  DW_TAG_member
	.dwattr $C$DW$433, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$433, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$433, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$433, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$433, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$433, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$433, DW_AT_decl_column(0x0c)
$C$DW$434	.dwtag  DW_TAG_member
	.dwattr $C$DW$434, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$434, DW_AT_name("rsvd2")
	.dwattr $C$DW$434, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$434, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
	.dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$434, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$434, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$434, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$47

	.dwattr $C$DW$T$47, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x08)

$C$DW$T$48	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$48, DW_AT_name("TZFLG_REG")
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
$C$DW$435	.dwtag  DW_TAG_member
	.dwattr $C$DW$435, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$435, DW_AT_name("all")
	.dwattr $C$DW$435, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$435, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$435, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$435, DW_AT_decl_column(0x1c)
$C$DW$436	.dwtag  DW_TAG_member
	.dwattr $C$DW$436, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$436, DW_AT_name("bit")
	.dwattr $C$DW$436, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$436, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$436, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$436, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$48

	.dwattr $C$DW$T$48, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x07)

$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_name("TZCLR_BITS")
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
$C$DW$437	.dwtag  DW_TAG_member
	.dwattr $C$DW$437, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$437, DW_AT_name("INT")
	.dwattr $C$DW$437, DW_AT_TI_symbol_name("_INT")
	.dwattr $C$DW$437, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$437, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$437, DW_AT_decl_line(0xed)
	.dwattr $C$DW$437, DW_AT_decl_column(0x0c)
$C$DW$438	.dwtag  DW_TAG_member
	.dwattr $C$DW$438, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$438, DW_AT_name("CBC")
	.dwattr $C$DW$438, DW_AT_TI_symbol_name("_CBC")
	.dwattr $C$DW$438, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$438, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$438, DW_AT_decl_line(0xee)
	.dwattr $C$DW$438, DW_AT_decl_column(0x0c)
$C$DW$439	.dwtag  DW_TAG_member
	.dwattr $C$DW$439, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$439, DW_AT_name("OST")
	.dwattr $C$DW$439, DW_AT_TI_symbol_name("_OST")
	.dwattr $C$DW$439, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$439, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$439, DW_AT_decl_line(0xef)
	.dwattr $C$DW$439, DW_AT_decl_column(0x0c)
$C$DW$440	.dwtag  DW_TAG_member
	.dwattr $C$DW$440, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$440, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$440, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$440, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$440, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$440, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$440, DW_AT_decl_column(0x0c)
$C$DW$441	.dwtag  DW_TAG_member
	.dwattr $C$DW$441, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$441, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$441, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$441, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$441, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$441, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$441, DW_AT_decl_column(0x0c)
$C$DW$442	.dwtag  DW_TAG_member
	.dwattr $C$DW$442, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$442, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$442, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$442, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$442, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$442, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$442, DW_AT_decl_column(0x0c)
$C$DW$443	.dwtag  DW_TAG_member
	.dwattr $C$DW$443, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$443, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$443, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$443, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$443, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$443, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$443, DW_AT_decl_column(0x0c)
$C$DW$444	.dwtag  DW_TAG_member
	.dwattr $C$DW$444, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$444, DW_AT_name("rsvd2")
	.dwattr $C$DW$444, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$444, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
	.dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$444, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$444, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$444, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$49

	.dwattr $C$DW$T$49, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xec)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x08)

$C$DW$T$50	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$50, DW_AT_name("TZCLR_REG")
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
$C$DW$445	.dwtag  DW_TAG_member
	.dwattr $C$DW$445, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$445, DW_AT_name("all")
	.dwattr $C$DW$445, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$445, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$445, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$445, DW_AT_decl_column(0x1c)
$C$DW$446	.dwtag  DW_TAG_member
	.dwattr $C$DW$446, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$446, DW_AT_name("bit")
	.dwattr $C$DW$446, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$446, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$446, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$446, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$50

	.dwattr $C$DW$T$50, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0xf7)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x07)

$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_name("TZFRC_BITS")
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
$C$DW$447	.dwtag  DW_TAG_member
	.dwattr $C$DW$447, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$447, DW_AT_name("rsvd1")
	.dwattr $C$DW$447, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$447, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$447, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$447, DW_AT_decl_line(0xff)
	.dwattr $C$DW$447, DW_AT_decl_column(0x0c)
$C$DW$448	.dwtag  DW_TAG_member
	.dwattr $C$DW$448, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$448, DW_AT_name("CBC")
	.dwattr $C$DW$448, DW_AT_TI_symbol_name("_CBC")
	.dwattr $C$DW$448, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$448, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$448, DW_AT_decl_line(0x100)
	.dwattr $C$DW$448, DW_AT_decl_column(0x0c)
$C$DW$449	.dwtag  DW_TAG_member
	.dwattr $C$DW$449, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$449, DW_AT_name("OST")
	.dwattr $C$DW$449, DW_AT_TI_symbol_name("_OST")
	.dwattr $C$DW$449, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$449, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$449, DW_AT_decl_line(0x101)
	.dwattr $C$DW$449, DW_AT_decl_column(0x0c)
$C$DW$450	.dwtag  DW_TAG_member
	.dwattr $C$DW$450, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$450, DW_AT_name("DCAEVT1")
	.dwattr $C$DW$450, DW_AT_TI_symbol_name("_DCAEVT1")
	.dwattr $C$DW$450, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$450, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$450, DW_AT_decl_line(0x102)
	.dwattr $C$DW$450, DW_AT_decl_column(0x0c)
$C$DW$451	.dwtag  DW_TAG_member
	.dwattr $C$DW$451, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$451, DW_AT_name("DCAEVT2")
	.dwattr $C$DW$451, DW_AT_TI_symbol_name("_DCAEVT2")
	.dwattr $C$DW$451, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$451, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$451, DW_AT_decl_line(0x103)
	.dwattr $C$DW$451, DW_AT_decl_column(0x0c)
$C$DW$452	.dwtag  DW_TAG_member
	.dwattr $C$DW$452, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$452, DW_AT_name("DCBEVT1")
	.dwattr $C$DW$452, DW_AT_TI_symbol_name("_DCBEVT1")
	.dwattr $C$DW$452, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$452, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$452, DW_AT_decl_line(0x104)
	.dwattr $C$DW$452, DW_AT_decl_column(0x0c)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$453, DW_AT_name("DCBEVT2")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_DCBEVT2")
	.dwattr $C$DW$453, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0x105)
	.dwattr $C$DW$453, DW_AT_decl_column(0x0c)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$454, DW_AT_name("rsvd2")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$454, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x106)
	.dwattr $C$DW$454, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$51

	.dwattr $C$DW$T$51, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x08)

$C$DW$T$52	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$52, DW_AT_name("TZFRC_REG")
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$455, DW_AT_name("all")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$455, DW_AT_decl_column(0x1c)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$456, DW_AT_name("bit")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$456, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$52

	.dwattr $C$DW$T$52, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x07)

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_name("ETSEL_BITS")
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$457, DW_AT_name("INTSEL")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_INTSEL")
	.dwattr $C$DW$457, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x111)
	.dwattr $C$DW$457, DW_AT_decl_column(0x0c)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$458, DW_AT_name("INTEN")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_INTEN")
	.dwattr $C$DW$458, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x112)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0c)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$459, DW_AT_name("rsvd1")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$459, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x113)
	.dwattr $C$DW$459, DW_AT_decl_column(0x0c)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$460, DW_AT_name("SOCASEL")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_SOCASEL")
	.dwattr $C$DW$460, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x03)
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x114)
	.dwattr $C$DW$460, DW_AT_decl_column(0x0c)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$461, DW_AT_name("SOCAEN")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_SOCAEN")
	.dwattr $C$DW$461, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x115)
	.dwattr $C$DW$461, DW_AT_decl_column(0x0c)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$462, DW_AT_name("SOCBSEL")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_SOCBSEL")
	.dwattr $C$DW$462, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x116)
	.dwattr $C$DW$462, DW_AT_decl_column(0x0c)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$463, DW_AT_name("SOCBEN")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_SOCBEN")
	.dwattr $C$DW$463, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x117)
	.dwattr $C$DW$463, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$53

	.dwattr $C$DW$T$53, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x08)

$C$DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$54, DW_AT_name("ETSEL_REG")
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$464, DW_AT_name("all")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$464, DW_AT_decl_column(0x1c)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$465, DW_AT_name("bit")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$465, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$54

	.dwattr $C$DW$T$54, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x07)

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_name("ETPS_BITS")
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$466, DW_AT_name("INTPRD")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_INTPRD")
	.dwattr $C$DW$466, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x123)
	.dwattr $C$DW$466, DW_AT_decl_column(0x0c)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$467, DW_AT_name("INTCNT")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_INTCNT")
	.dwattr $C$DW$467, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x124)
	.dwattr $C$DW$467, DW_AT_decl_column(0x0c)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$468, DW_AT_name("rsvd1")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$468, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x125)
	.dwattr $C$DW$468, DW_AT_decl_column(0x0c)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$469, DW_AT_name("SOCAPRD")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_SOCAPRD")
	.dwattr $C$DW$469, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x126)
	.dwattr $C$DW$469, DW_AT_decl_column(0x0c)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$470, DW_AT_name("SOCACNT")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_SOCACNT")
	.dwattr $C$DW$470, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x127)
	.dwattr $C$DW$470, DW_AT_decl_column(0x0c)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$471, DW_AT_name("SOCBPRD")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_SOCBPRD")
	.dwattr $C$DW$471, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x128)
	.dwattr $C$DW$471, DW_AT_decl_column(0x0c)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$472, DW_AT_name("SOCBCNT")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_SOCBCNT")
	.dwattr $C$DW$472, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x129)
	.dwattr $C$DW$472, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$55

	.dwattr $C$DW$T$55, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x122)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x08)

$C$DW$T$56	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$56, DW_AT_name("ETPS_REG")
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$473, DW_AT_name("all")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$473, DW_AT_decl_column(0x1c)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$474, DW_AT_name("bit")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$474, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$56

	.dwattr $C$DW$T$56, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x07)

$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_name("ETFLG_BITS")
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$475, DW_AT_name("INT")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_INT")
	.dwattr $C$DW$475, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x134)
	.dwattr $C$DW$475, DW_AT_decl_column(0x0c)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$476, DW_AT_name("rsvd1")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_rsvd1")
	.dwattr $C$DW$476, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x135)
	.dwattr $C$DW$476, DW_AT_decl_column(0x0c)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$477, DW_AT_name("SOCA")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_SOCA")
	.dwattr $C$DW$477, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x136)
	.dwattr $C$DW$477, DW_AT_decl_column(0x0c)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$478, DW_AT_name("SOCB")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_SOCB")
	.dwattr $C$DW$478, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x137)
	.dwattr $C$DW$478, DW_AT_decl_column(0x0c)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$479, DW_AT_name("rsvd2")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_rsvd2")
	.dwattr $C$DW$479, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x138)
	.dwattr $C$DW$479, DW_AT_decl_column(0x0c)
	.dwendtag $C$DW$T$57

	.dwattr $C$DW$T$57, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x08)

$C$DW$T$58	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$58, DW_AT_name("ETFLG_REG")
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$480, DW_AT_name("all")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$480, DW_AT_decl_column(0x1d)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$481, DW_AT_name("bit")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$481, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$58

	.dwattr $C$DW$T$58, DW_AT_decl_file("..\include\DSP2803x_EPwm.h")
