;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
;* Date/Time created: Wed Jul 24 10:05:58 2019                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("KeyBoard.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Drive0X\trunk\16-PEU11C33\03-C33M07-ABS\app\source")
$C$DW$1	.dwtag  DW_TAG_variable, DW_AT_name("uRunStopCmd4")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_uRunStopCmd4")
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$675)
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x281)
	.dwattr $C$DW$1, DW_AT_decl_column(0x23)
$C$DW$2	.dwtag  DW_TAG_variable, DW_AT_name("uRunStopStatus1")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_uRunStopStatus1")
	.dwattr $C$DW$2, DW_AT_type(*$C$DW$T$676)
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external
	.dwattr $C$DW$2, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$2, DW_AT_decl_line(0x28d)
	.dwattr $C$DW$2, DW_AT_decl_column(0x25)

$C$DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$50, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x19)

$C$DW$T$51	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
$C$DW$447	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$447, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$51


$C$DW$T$52	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x0a)
$C$DW$448	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$448, DW_AT_upper_bound(0x04)
$C$DW$449	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$449, DW_AT_upper_bound(0x00)
	.dwendtag $C$DW$T$52


$C$DW$T$404	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$404, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$404, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$404, DW_AT_byte_size(0x04)
$C$DW$450	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$450, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$404


$C$DW$T$405	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$405, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$405, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$405, DW_AT_byte_size(0x0c)
$C$DW$451	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$451, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$405


$C$DW$T$406	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$406, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$406, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$406, DW_AT_byte_size(0x08)
$C$DW$452	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$452, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$406

$C$DW$T$515	.dwtag  DW_TAG_typedef, DW_AT_name("uword")
	.dwattr $C$DW$T$515, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$515, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$515, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$515, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$515, DW_AT_decl_column(0x19)
$C$DW$T$520	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$520, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$520, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$520, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$520, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$520, DW_AT_decl_column(0x19)
$C$DW$T$644	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$644, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$644, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$644, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$644, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$644, DW_AT_decl_column(0x1b)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$654	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$654, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$654, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$654, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$654, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$654, DW_AT_decl_column(0x1a)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$655	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$655, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$655, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$655, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$655, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$655, DW_AT_decl_column(0x1d)
$C$DW$T$656	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$656, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$656, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$656, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$656, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$656, DW_AT_decl_column(0x1e)
$C$DW$T$657	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$657, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$657, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$657, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$657, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$657, DW_AT_decl_column(0x1e)
$C$DW$T$658	.dwtag  DW_TAG_typedef, DW_AT_name("QWORD")
	.dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$658, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$658, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$658, DW_AT_decl_column(0x1e)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$659	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$659, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$659, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$659, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$659, DW_AT_decl_column(0x1a)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$660	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$660, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$660, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$660, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$660, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$660, DW_AT_decl_column(0x1a)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x02)
$C$DW$453	.dwtag  DW_TAG_member
	.dwattr $C$DW$453, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$453, DW_AT_name("ignore")
	.dwattr $C$DW$453, DW_AT_TI_symbol_name("_ignore")
	.dwattr $C$DW$453, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$453, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$453, DW_AT_decl_line(0x16)
	.dwattr $C$DW$453, DW_AT_decl_column(0x0b)
$C$DW$454	.dwtag  DW_TAG_member
	.dwattr $C$DW$454, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$454, DW_AT_name("modify")
	.dwattr $C$DW$454, DW_AT_TI_symbol_name("_modify")
	.dwattr $C$DW$454, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$454, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$454, DW_AT_decl_line(0x17)
	.dwattr $C$DW$454, DW_AT_decl_column(0x0b)
$C$DW$455	.dwtag  DW_TAG_member
	.dwattr $C$DW$455, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$455, DW_AT_name("PLCmodify")
	.dwattr $C$DW$455, DW_AT_TI_symbol_name("_PLCmodify")
	.dwattr $C$DW$455, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$455, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$455, DW_AT_decl_line(0x18)
	.dwattr $C$DW$455, DW_AT_decl_column(0x0b)
$C$DW$456	.dwtag  DW_TAG_member
	.dwattr $C$DW$456, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$456, DW_AT_name("changed")
	.dwattr $C$DW$456, DW_AT_TI_symbol_name("_changed")
	.dwattr $C$DW$456, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$456, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$456, DW_AT_decl_line(0x19)
	.dwattr $C$DW$456, DW_AT_decl_column(0x0b)
$C$DW$457	.dwtag  DW_TAG_member
	.dwattr $C$DW$457, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$457, DW_AT_name("rsv")
	.dwattr $C$DW$457, DW_AT_TI_symbol_name("_rsv")
	.dwattr $C$DW$457, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$457, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$457, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$457, DW_AT_decl_column(0x0b)
$C$DW$458	.dwtag  DW_TAG_member
	.dwattr $C$DW$458, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$458, DW_AT_name("value")
	.dwattr $C$DW$458, DW_AT_TI_symbol_name("_value")
	.dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$458, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$458, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$458, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("FuncBits")
	.dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$22, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x03)
$C$DW$T$661	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$661, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$661, DW_AT_address_class(0x16)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x1ba)
$C$DW$459	.dwtag  DW_TAG_member
	.dwattr $C$DW$459, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$459, DW_AT_name("MenuModeSlt")
	.dwattr $C$DW$459, DW_AT_TI_symbol_name("_MenuModeSlt")
	.dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$459, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$459, DW_AT_decl_line(0x27)
	.dwattr $C$DW$459, DW_AT_decl_column(0x1a)
$C$DW$460	.dwtag  DW_TAG_member
	.dwattr $C$DW$460, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$460, DW_AT_name("AppDate")
	.dwattr $C$DW$460, DW_AT_TI_symbol_name("_AppDate")
	.dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$460, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$460, DW_AT_decl_line(0x28)
	.dwattr $C$DW$460, DW_AT_decl_column(0x1a)
$C$DW$461	.dwtag  DW_TAG_member
	.dwattr $C$DW$461, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$461, DW_AT_name("AutoDate")
	.dwattr $C$DW$461, DW_AT_TI_symbol_name("_AutoDate")
	.dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$461, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$461, DW_AT_decl_line(0x29)
	.dwattr $C$DW$461, DW_AT_decl_column(0x1a)
$C$DW$462	.dwtag  DW_TAG_member
	.dwattr $C$DW$462, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$462, DW_AT_name("DriveVer")
	.dwattr $C$DW$462, DW_AT_TI_symbol_name("_DriveVer")
	.dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$462, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$462, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$462, DW_AT_decl_column(0x1a)
$C$DW$463	.dwtag  DW_TAG_member
	.dwattr $C$DW$463, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$463, DW_AT_name("BootVer")
	.dwattr $C$DW$463, DW_AT_TI_symbol_name("_BootVer")
	.dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$463, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$463, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$463, DW_AT_decl_column(0x1a)
$C$DW$464	.dwtag  DW_TAG_member
	.dwattr $C$DW$464, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$464, DW_AT_name("ParaInit")
	.dwattr $C$DW$464, DW_AT_TI_symbol_name("_ParaInit")
	.dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$464, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$464, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$464, DW_AT_decl_column(0x1a)
$C$DW$465	.dwtag  DW_TAG_member
	.dwattr $C$DW$465, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$465, DW_AT_name("ParaCopy")
	.dwattr $C$DW$465, DW_AT_TI_symbol_name("_ParaCopy")
	.dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$465, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$465, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$465, DW_AT_decl_column(0x1a)
$C$DW$466	.dwtag  DW_TAG_member
	.dwattr $C$DW$466, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$466, DW_AT_name("MainFrqRef")
	.dwattr $C$DW$466, DW_AT_TI_symbol_name("_MainFrqRef")
	.dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$466, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$466, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$466, DW_AT_decl_column(0x1a)
$C$DW$467	.dwtag  DW_TAG_member
	.dwattr $C$DW$467, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$467, DW_AT_name("OutFrqRef")
	.dwattr $C$DW$467, DW_AT_TI_symbol_name("_OutFrqRef")
	.dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$467, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$467, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$467, DW_AT_decl_column(0x1a)
$C$DW$468	.dwtag  DW_TAG_member
	.dwattr $C$DW$468, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$468, DW_AT_name("OutFrq")
	.dwattr $C$DW$468, DW_AT_TI_symbol_name("_OutFrq")
	.dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$468, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$468, DW_AT_decl_line(0x30)
	.dwattr $C$DW$468, DW_AT_decl_column(0x1a)
$C$DW$469	.dwtag  DW_TAG_member
	.dwattr $C$DW$469, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$469, DW_AT_name("OutVoltage")
	.dwattr $C$DW$469, DW_AT_TI_symbol_name("_OutVoltage")
	.dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$469, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$469, DW_AT_decl_line(0x31)
	.dwattr $C$DW$469, DW_AT_decl_column(0x1a)
$C$DW$470	.dwtag  DW_TAG_member
	.dwattr $C$DW$470, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$470, DW_AT_name("OutCurrent")
	.dwattr $C$DW$470, DW_AT_TI_symbol_name("_OutCurrent")
	.dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$470, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$470, DW_AT_decl_line(0x32)
	.dwattr $C$DW$470, DW_AT_decl_column(0x1a)
$C$DW$471	.dwtag  DW_TAG_member
	.dwattr $C$DW$471, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$471, DW_AT_name("TorqCurrent")
	.dwattr $C$DW$471, DW_AT_TI_symbol_name("_TorqCurrent")
	.dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$471, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$471, DW_AT_decl_line(0x33)
	.dwattr $C$DW$471, DW_AT_decl_column(0x1a)
$C$DW$472	.dwtag  DW_TAG_member
	.dwattr $C$DW$472, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$472, DW_AT_name("MagFluxCurrent")
	.dwattr $C$DW$472, DW_AT_TI_symbol_name("_MagFluxCurrent")
	.dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$472, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$472, DW_AT_decl_line(0x34)
	.dwattr $C$DW$472, DW_AT_decl_column(0x1a)
$C$DW$473	.dwtag  DW_TAG_member
	.dwattr $C$DW$473, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$473, DW_AT_name("TorqRef")
	.dwattr $C$DW$473, DW_AT_TI_symbol_name("_TorqRef")
	.dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$473, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$473, DW_AT_decl_line(0x35)
	.dwattr $C$DW$473, DW_AT_decl_column(0x1a)
$C$DW$474	.dwtag  DW_TAG_member
	.dwattr $C$DW$474, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$474, DW_AT_name("OutTorq")
	.dwattr $C$DW$474, DW_AT_TI_symbol_name("_OutTorq")
	.dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$474, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$474, DW_AT_decl_line(0x36)
	.dwattr $C$DW$474, DW_AT_decl_column(0x1a)
$C$DW$475	.dwtag  DW_TAG_member
	.dwattr $C$DW$475, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$475, DW_AT_name("MotorPower")
	.dwattr $C$DW$475, DW_AT_TI_symbol_name("_MotorPower")
	.dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$475, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$475, DW_AT_decl_line(0x37)
	.dwattr $C$DW$475, DW_AT_decl_column(0x1a)
$C$DW$476	.dwtag  DW_TAG_member
	.dwattr $C$DW$476, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$476, DW_AT_name("MaxDriveTorque")
	.dwattr $C$DW$476, DW_AT_TI_symbol_name("_MaxDriveTorque")
	.dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$476, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$476, DW_AT_decl_line(0x38)
	.dwattr $C$DW$476, DW_AT_decl_column(0x1a)
$C$DW$477	.dwtag  DW_TAG_member
	.dwattr $C$DW$477, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$477, DW_AT_name("MaxBraveTorque")
	.dwattr $C$DW$477, DW_AT_TI_symbol_name("_MaxBraveTorque")
	.dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$477, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$477, DW_AT_decl_line(0x39)
	.dwattr $C$DW$477, DW_AT_decl_column(0x1a)
$C$DW$478	.dwtag  DW_TAG_member
	.dwattr $C$DW$478, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$478, DW_AT_name("DCVoltage")
	.dwattr $C$DW$478, DW_AT_TI_symbol_name("_DCVoltage")
	.dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$478, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$478, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$478, DW_AT_decl_column(0x1a)
$C$DW$479	.dwtag  DW_TAG_member
	.dwattr $C$DW$479, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$479, DW_AT_name("DetMtrFrq")
	.dwattr $C$DW$479, DW_AT_TI_symbol_name("_DetMtrFrq")
	.dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$479, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$479, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$479, DW_AT_decl_column(0x1a)
$C$DW$480	.dwtag  DW_TAG_member
	.dwattr $C$DW$480, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$480, DW_AT_name("MDIStatus")
	.dwattr $C$DW$480, DW_AT_TI_symbol_name("_MDIStatus")
	.dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$480, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$480, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$480, DW_AT_decl_column(0x1a)
$C$DW$481	.dwtag  DW_TAG_member
	.dwattr $C$DW$481, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$481, DW_AT_name("DITermStatus")
	.dwattr $C$DW$481, DW_AT_TI_symbol_name("_DITermStatus")
	.dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$481, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$481, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$481, DW_AT_decl_column(0x1a)
$C$DW$482	.dwtag  DW_TAG_member
	.dwattr $C$DW$482, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$482, DW_AT_name("DOTermStatus")
	.dwattr $C$DW$482, DW_AT_TI_symbol_name("_DOTermStatus")
	.dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$482, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$482, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$482, DW_AT_decl_column(0x1a)
$C$DW$483	.dwtag  DW_TAG_member
	.dwattr $C$DW$483, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$483, DW_AT_name("AI1Volt")
	.dwattr $C$DW$483, DW_AT_TI_symbol_name("_AI1Volt")
	.dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$483, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$483, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$483, DW_AT_decl_column(0x1a)
$C$DW$484	.dwtag  DW_TAG_member
	.dwattr $C$DW$484, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$484, DW_AT_name("AI2Volt")
	.dwattr $C$DW$484, DW_AT_TI_symbol_name("_AI2Volt")
	.dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$484, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$484, DW_AT_decl_line(0x40)
	.dwattr $C$DW$484, DW_AT_decl_column(0x1a)
$C$DW$485	.dwtag  DW_TAG_member
	.dwattr $C$DW$485, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$485, DW_AT_name("ConVolt")
	.dwattr $C$DW$485, DW_AT_TI_symbol_name("_ConVolt")
	.dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$485, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$485, DW_AT_decl_line(0x41)
	.dwattr $C$DW$485, DW_AT_decl_column(0x1a)
$C$DW$486	.dwtag  DW_TAG_member
	.dwattr $C$DW$486, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$486, DW_AT_name("TorqLimit")
	.dwattr $C$DW$486, DW_AT_TI_symbol_name("_TorqLimit")
	.dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$486, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$486, DW_AT_decl_line(0x42)
	.dwattr $C$DW$486, DW_AT_decl_column(0x1a)
$C$DW$487	.dwtag  DW_TAG_member
	.dwattr $C$DW$487, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$487, DW_AT_name("DCCur")
	.dwattr $C$DW$487, DW_AT_TI_symbol_name("_DCCur")
	.dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$487, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$487, DW_AT_decl_line(0x43)
	.dwattr $C$DW$487, DW_AT_decl_column(0x1a)
$C$DW$488	.dwtag  DW_TAG_member
	.dwattr $C$DW$488, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$488, DW_AT_name("MCUTemp")
	.dwattr $C$DW$488, DW_AT_TI_symbol_name("_MCUTemp")
	.dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$488, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$488, DW_AT_decl_line(0x44)
	.dwattr $C$DW$488, DW_AT_decl_column(0x1a)
$C$DW$489	.dwtag  DW_TAG_member
	.dwattr $C$DW$489, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$489, DW_AT_name("MotorTemp")
	.dwattr $C$DW$489, DW_AT_TI_symbol_name("_MotorTemp")
	.dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$489, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$489, DW_AT_decl_line(0x45)
	.dwattr $C$DW$489, DW_AT_decl_column(0x1a)
$C$DW$490	.dwtag  DW_TAG_member
	.dwattr $C$DW$490, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$490, DW_AT_name("Speedrpm")
	.dwattr $C$DW$490, DW_AT_TI_symbol_name("_Speedrpm")
	.dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$490, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$490, DW_AT_decl_line(0x46)
	.dwattr $C$DW$490, DW_AT_decl_column(0x1a)
$C$DW$491	.dwtag  DW_TAG_member
	.dwattr $C$DW$491, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$491, DW_AT_name("MtrCtrlSelect")
	.dwattr $C$DW$491, DW_AT_TI_symbol_name("_MtrCtrlSelect")
	.dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$491, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$491, DW_AT_decl_line(0x47)
	.dwattr $C$DW$491, DW_AT_decl_column(0x1a)
$C$DW$492	.dwtag  DW_TAG_member
	.dwattr $C$DW$492, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$492, DW_AT_name("MainFrqSourceSlt")
	.dwattr $C$DW$492, DW_AT_TI_symbol_name("_MainFrqSourceSlt")
	.dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$492, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$492, DW_AT_decl_line(0x48)
	.dwattr $C$DW$492, DW_AT_decl_column(0x1a)
$C$DW$493	.dwtag  DW_TAG_member
	.dwattr $C$DW$493, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$493, DW_AT_name("RunCmdChannel")
	.dwattr $C$DW$493, DW_AT_TI_symbol_name("_RunCmdChannel")
	.dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$493, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$493, DW_AT_decl_line(0x49)
	.dwattr $C$DW$493, DW_AT_decl_column(0x1a)
$C$DW$494	.dwtag  DW_TAG_member
	.dwattr $C$DW$494, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$494, DW_AT_name("RunDir")
	.dwattr $C$DW$494, DW_AT_TI_symbol_name("_RunDir")
	.dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$494, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$494, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$494, DW_AT_decl_column(0x1a)
$C$DW$495	.dwtag  DW_TAG_member
	.dwattr $C$DW$495, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$495, DW_AT_name("StopDetectFrq")
	.dwattr $C$DW$495, DW_AT_TI_symbol_name("_StopDetectFrq")
	.dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$495, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$495, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$495, DW_AT_decl_column(0x1a)
$C$DW$496	.dwtag  DW_TAG_member
	.dwattr $C$DW$496, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$496, DW_AT_name("MainFrqDigiSet")
	.dwattr $C$DW$496, DW_AT_TI_symbol_name("_MainFrqDigiSet")
	.dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$496, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$496, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$496, DW_AT_decl_column(0x1a)
$C$DW$497	.dwtag  DW_TAG_member
	.dwattr $C$DW$497, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$497, DW_AT_name("AccTime1")
	.dwattr $C$DW$497, DW_AT_TI_symbol_name("_AccTime1")
	.dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$497, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$497, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$497, DW_AT_decl_column(0x1a)
$C$DW$498	.dwtag  DW_TAG_member
	.dwattr $C$DW$498, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$498, DW_AT_name("DecTime1")
	.dwattr $C$DW$498, DW_AT_TI_symbol_name("_DecTime1")
	.dwattr $C$DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr $C$DW$498, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$498, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$498, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$498, DW_AT_decl_column(0x1a)
$C$DW$499	.dwtag  DW_TAG_member
	.dwattr $C$DW$499, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$499, DW_AT_name("MaxOutFrq")
	.dwattr $C$DW$499, DW_AT_TI_symbol_name("_MaxOutFrq")
	.dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$499, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$499, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$499, DW_AT_decl_column(0x1a)
$C$DW$500	.dwtag  DW_TAG_member
	.dwattr $C$DW$500, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$500, DW_AT_name("M1RatedPower")
	.dwattr $C$DW$500, DW_AT_TI_symbol_name("_M1RatedPower")
	.dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$500, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$500, DW_AT_decl_line(0x50)
	.dwattr $C$DW$500, DW_AT_decl_column(0x1a)
$C$DW$501	.dwtag  DW_TAG_member
	.dwattr $C$DW$501, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$501, DW_AT_name("M1RatedVoltage")
	.dwattr $C$DW$501, DW_AT_TI_symbol_name("_M1RatedVoltage")
	.dwattr $C$DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr $C$DW$501, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$501, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$501, DW_AT_decl_line(0x51)
	.dwattr $C$DW$501, DW_AT_decl_column(0x1a)
$C$DW$502	.dwtag  DW_TAG_member
	.dwattr $C$DW$502, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$502, DW_AT_name("M1RatedCurrent")
	.dwattr $C$DW$502, DW_AT_TI_symbol_name("_M1RatedCurrent")
	.dwattr $C$DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr $C$DW$502, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$502, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$502, DW_AT_decl_line(0x52)
	.dwattr $C$DW$502, DW_AT_decl_column(0x1a)
$C$DW$503	.dwtag  DW_TAG_member
	.dwattr $C$DW$503, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$503, DW_AT_name("M1RatedFrq")
	.dwattr $C$DW$503, DW_AT_TI_symbol_name("_M1RatedFrq")
	.dwattr $C$DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr $C$DW$503, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$503, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$503, DW_AT_decl_line(0x53)
	.dwattr $C$DW$503, DW_AT_decl_column(0x1a)
$C$DW$504	.dwtag  DW_TAG_member
	.dwattr $C$DW$504, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$504, DW_AT_name("M1RatedSpd")
	.dwattr $C$DW$504, DW_AT_TI_symbol_name("_M1RatedSpd")
	.dwattr $C$DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr $C$DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$504, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$504, DW_AT_decl_line(0x54)
	.dwattr $C$DW$504, DW_AT_decl_column(0x1a)
$C$DW$505	.dwtag  DW_TAG_member
	.dwattr $C$DW$505, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$505, DW_AT_name("M1PowerFactor")
	.dwattr $C$DW$505, DW_AT_TI_symbol_name("_M1PowerFactor")
	.dwattr $C$DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr $C$DW$505, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$505, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$505, DW_AT_decl_line(0x55)
	.dwattr $C$DW$505, DW_AT_decl_column(0x1a)
$C$DW$506	.dwtag  DW_TAG_member
	.dwattr $C$DW$506, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$506, DW_AT_name("M1R1")
	.dwattr $C$DW$506, DW_AT_TI_symbol_name("_M1R1")
	.dwattr $C$DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr $C$DW$506, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$506, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$506, DW_AT_decl_line(0x56)
	.dwattr $C$DW$506, DW_AT_decl_column(0x1a)
$C$DW$507	.dwtag  DW_TAG_member
	.dwattr $C$DW$507, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$507, DW_AT_name("M1X1orLD")
	.dwattr $C$DW$507, DW_AT_TI_symbol_name("_M1X1orLD")
	.dwattr $C$DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$507, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$507, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0x57)
	.dwattr $C$DW$507, DW_AT_decl_column(0x1a)
$C$DW$508	.dwtag  DW_TAG_member
	.dwattr $C$DW$508, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$508, DW_AT_name("M1R2orEmf")
	.dwattr $C$DW$508, DW_AT_TI_symbol_name("_M1R2orEmf")
	.dwattr $C$DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr $C$DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$508, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x58)
	.dwattr $C$DW$508, DW_AT_decl_column(0x1a)
$C$DW$509	.dwtag  DW_TAG_member
	.dwattr $C$DW$509, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$509, DW_AT_name("M1XmorLq")
	.dwattr $C$DW$509, DW_AT_TI_symbol_name("_M1XmorLq")
	.dwattr $C$DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$509, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$509, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x59)
	.dwattr $C$DW$509, DW_AT_decl_column(0x1a)
$C$DW$510	.dwtag  DW_TAG_member
	.dwattr $C$DW$510, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$510, DW_AT_name("MotorMagnetCurrent")
	.dwattr $C$DW$510, DW_AT_TI_symbol_name("_MotorMagnetCurrent")
	.dwattr $C$DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$510, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$510, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$510, DW_AT_decl_column(0x1a)
$C$DW$511	.dwtag  DW_TAG_member
	.dwattr $C$DW$511, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$511, DW_AT_name("MotorPolePairs")
	.dwattr $C$DW$511, DW_AT_TI_symbol_name("_MotorPolePairs")
	.dwattr $C$DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$511, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$511, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$511, DW_AT_decl_column(0x1a)
$C$DW$512	.dwtag  DW_TAG_member
	.dwattr $C$DW$512, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$512, DW_AT_name("MotorSlipFrequency2")
	.dwattr $C$DW$512, DW_AT_TI_symbol_name("_MotorSlipFrequency2")
	.dwattr $C$DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$512, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$512, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$512, DW_AT_decl_column(0x1a)
$C$DW$513	.dwtag  DW_TAG_member
	.dwattr $C$DW$513, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$513, DW_AT_name("M1Ld")
	.dwattr $C$DW$513, DW_AT_TI_symbol_name("_M1Ld")
	.dwattr $C$DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr $C$DW$513, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$513, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$513, DW_AT_decl_column(0x1a)
$C$DW$514	.dwtag  DW_TAG_member
	.dwattr $C$DW$514, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$514, DW_AT_name("M1Lq")
	.dwattr $C$DW$514, DW_AT_TI_symbol_name("_M1Lq")
	.dwattr $C$DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr $C$DW$514, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$514, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$514, DW_AT_decl_column(0x1a)
$C$DW$515	.dwtag  DW_TAG_member
	.dwattr $C$DW$515, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$515, DW_AT_name("M1Emf")
	.dwattr $C$DW$515, DW_AT_TI_symbol_name("_M1Emf")
	.dwattr $C$DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$515, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$515, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$515, DW_AT_decl_column(0x1a)
$C$DW$516	.dwtag  DW_TAG_member
	.dwattr $C$DW$516, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$516, DW_AT_name("M1OLAlarm")
	.dwattr $C$DW$516, DW_AT_TI_symbol_name("_M1OLAlarm")
	.dwattr $C$DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr $C$DW$516, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$516, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x60)
	.dwattr $C$DW$516, DW_AT_decl_column(0x1a)
$C$DW$517	.dwtag  DW_TAG_member
	.dwattr $C$DW$517, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$517, DW_AT_name("M1OLCoeff")
	.dwattr $C$DW$517, DW_AT_TI_symbol_name("_M1OLCoeff")
	.dwattr $C$DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$517, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$517, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x61)
	.dwattr $C$DW$517, DW_AT_decl_column(0x1a)
$C$DW$518	.dwtag  DW_TAG_member
	.dwattr $C$DW$518, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$518, DW_AT_name("M1OLTime")
	.dwattr $C$DW$518, DW_AT_TI_symbol_name("_M1OLTime")
	.dwattr $C$DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$518, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$518, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x62)
	.dwattr $C$DW$518, DW_AT_decl_column(0x1a)
$C$DW$519	.dwtag  DW_TAG_member
	.dwattr $C$DW$519, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$519, DW_AT_name("MotorMode")
	.dwattr $C$DW$519, DW_AT_TI_symbol_name("_MotorMode")
	.dwattr $C$DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr $C$DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$519, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x63)
	.dwattr $C$DW$519, DW_AT_decl_column(0x1a)
$C$DW$520	.dwtag  DW_TAG_member
	.dwattr $C$DW$520, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$520, DW_AT_name("DeratFact2")
	.dwattr $C$DW$520, DW_AT_TI_symbol_name("_DeratFact2")
	.dwattr $C$DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
	.dwattr $C$DW$520, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$520, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x64)
	.dwattr $C$DW$520, DW_AT_decl_column(0x1a)
$C$DW$521	.dwtag  DW_TAG_member
	.dwattr $C$DW$521, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$521, DW_AT_name("DeratFact1")
	.dwattr $C$DW$521, DW_AT_TI_symbol_name("_DeratFact1")
	.dwattr $C$DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr $C$DW$521, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$521, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x65)
	.dwattr $C$DW$521, DW_AT_decl_column(0x1a)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$522, DW_AT_name("M1OLValue")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("_M1OLValue")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x66)
	.dwattr $C$DW$522, DW_AT_decl_column(0x1a)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$523, DW_AT_name("MotorPhase")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("_MotorPhase")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x67)
	.dwattr $C$DW$523, DW_AT_decl_column(0x1a)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$524, DW_AT_name("TuneMode")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("_TuneMode")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x68)
	.dwattr $C$DW$524, DW_AT_decl_column(0x1a)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$525, DW_AT_name("SM1TuneCurrent")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("_SM1TuneCurrent")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x69)
	.dwattr $C$DW$525, DW_AT_decl_column(0x1a)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$526, DW_AT_name("SMIniAng")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("_SMIniAng")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$526, DW_AT_decl_column(0x1a)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$527, DW_AT_name("SMZPlsAng")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("_SMZPlsAng")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$527, DW_AT_decl_column(0x1a)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$528, DW_AT_name("PGSlt")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("_PGSlt")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$528, DW_AT_decl_column(0x1a)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$529, DW_AT_name("PGPulsPerR")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("_PGPulsPerR")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$529, DW_AT_decl_column(0x1a)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$530, DW_AT_name("PGDirect")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("_PGDirect")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$530, DW_AT_decl_column(0x1a)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$531, DW_AT_name("PGFilterCoef")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("_PGFilterCoef")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$531, DW_AT_decl_column(0x1a)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$532, DW_AT_name("ResolverPP")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("_ResolverPP")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x70)
	.dwattr $C$DW$532, DW_AT_decl_column(0x1a)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$533, DW_AT_name("ResolverTest")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("_ResolverTest")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x71)
	.dwattr $C$DW$533, DW_AT_decl_column(0x1a)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$534, DW_AT_name("ResolverAmpTest")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("_ResolverAmpTest")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x72)
	.dwattr $C$DW$534, DW_AT_decl_column(0x1a)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$535, DW_AT_name("ResolverAmpSet")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("_ResolverAmpSet")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x73)
	.dwattr $C$DW$535, DW_AT_decl_column(0x1a)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$536, DW_AT_name("ResolverCheckOut")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("_ResolverCheckOut")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x74)
	.dwattr $C$DW$536, DW_AT_decl_column(0x1a)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$537, DW_AT_name("ResolverCheckNumber")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("_ResolverCheckNumber")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x75)
	.dwattr $C$DW$537, DW_AT_decl_column(0x1a)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$538, DW_AT_name("Rsv50")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("_Rsv50")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x76)
	.dwattr $C$DW$538, DW_AT_decl_column(0x1a)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$539, DW_AT_name("ASR1P")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("_ASR1P")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x77)
	.dwattr $C$DW$539, DW_AT_decl_column(0x1a)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$540, DW_AT_name("ASR1I")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("_ASR1I")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x78)
	.dwattr $C$DW$540, DW_AT_decl_column(0x1a)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$541, DW_AT_name("FieldWeakKp")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("_FieldWeakKp")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x79)
	.dwattr $C$DW$541, DW_AT_decl_column(0x1a)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$542, DW_AT_name("FieldWeakTi")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("_FieldWeakTi")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$542, DW_AT_decl_column(0x1a)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$543, DW_AT_name("AccMax")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("_AccMax")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$543, DW_AT_decl_column(0x1a)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$544, DW_AT_name("AccJerkStart")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("_AccJerkStart")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$544, DW_AT_decl_column(0x1a)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$545, DW_AT_name("AccJerkEnd")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("_AccJerkEnd")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$545, DW_AT_decl_column(0x1a)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$546, DW_AT_name("DecMax")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("_DecMax")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$546, DW_AT_decl_column(0x1a)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$547, DW_AT_name("DecJerkStart")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("_DecJerkStart")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$547, DW_AT_decl_column(0x1a)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$548, DW_AT_name("DecJerkEnd")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("_DecJerkEnd")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x80)
	.dwattr $C$DW$548, DW_AT_decl_column(0x1a)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$549, DW_AT_name("TorqSpdSelect")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("_TorqSpdSelect")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x81)
	.dwattr $C$DW$549, DW_AT_decl_column(0x1a)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$550, DW_AT_name("TorqRefSlt")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("_TorqRefSlt")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x82)
	.dwattr $C$DW$550, DW_AT_decl_column(0x1a)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$551, DW_AT_name("TorqRefChannel")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("_TorqRefChannel")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x83)
	.dwattr $C$DW$551, DW_AT_decl_column(0x1a)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$552, DW_AT_name("TorqKbRef")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("_TorqKbRef")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x84)
	.dwattr $C$DW$552, DW_AT_decl_column(0x1a)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$553, DW_AT_name("TorAccDecTime")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("_TorAccDecTime")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x85)
	.dwattr $C$DW$553, DW_AT_decl_column(0x1a)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$554, DW_AT_name("SpdLmt1")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("_SpdLmt1")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x86)
	.dwattr $C$DW$554, DW_AT_decl_column(0x1a)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$555, DW_AT_name("SpdLmt2")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("_SpdLmt2")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x87)
	.dwattr $C$DW$555, DW_AT_decl_column(0x1a)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$556, DW_AT_name("TorqLmtFwdPos")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("_TorqLmtFwdPos")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x88)
	.dwattr $C$DW$556, DW_AT_decl_column(0x1a)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$557, DW_AT_name("TorqLmtFwdNeg")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("_TorqLmtFwdNeg")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x89)
	.dwattr $C$DW$557, DW_AT_decl_column(0x1a)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$558, DW_AT_name("TorqLmtRsvPos")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("_TorqLmtRsvPos")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$558, DW_AT_decl_column(0x1a)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$559, DW_AT_name("TorqLmtRsvNeg")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("_TorqLmtRsvNeg")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$559, DW_AT_decl_column(0x1a)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$560, DW_AT_name("SlideSpeedEnter")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("_SlideSpeedEnter")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$560, DW_AT_decl_column(0x1a)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$561, DW_AT_name("SlideSpeedExit")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("_SlideSpeedExit")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$561, DW_AT_decl_column(0x1a)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$562, DW_AT_name("SpdLmtFreq1")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("_SpdLmtFreq1")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$562, DW_AT_decl_column(0x1a)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$563, DW_AT_name("SpdLmtFreq2")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("_SpdLmtFreq2")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$563, DW_AT_decl_column(0x1a)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$564, DW_AT_name("IqULimit")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("_IqULimit")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x90)
	.dwattr $C$DW$564, DW_AT_decl_column(0x1a)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$565, DW_AT_name("IqLLmit")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("_IqLLmit")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x91)
	.dwattr $C$DW$565, DW_AT_decl_column(0x1a)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$566, DW_AT_name("IqSetUnlim")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("_IqSetUnlim")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x92)
	.dwattr $C$DW$566, DW_AT_decl_column(0x1a)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$567, DW_AT_name("IqAct")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("_IqAct")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x93)
	.dwattr $C$DW$567, DW_AT_decl_column(0x1a)
$C$DW$568	.dwtag  DW_TAG_member
	.dwattr $C$DW$568, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$568, DW_AT_name("SlipCutTime")
	.dwattr $C$DW$568, DW_AT_TI_symbol_name("_SlipCutTime")
	.dwattr $C$DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
	.dwattr $C$DW$568, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$568, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$568, DW_AT_decl_line(0x94)
	.dwattr $C$DW$568, DW_AT_decl_column(0x1a)
$C$DW$569	.dwtag  DW_TAG_member
	.dwattr $C$DW$569, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$569, DW_AT_name("SlipCutSpeed")
	.dwattr $C$DW$569, DW_AT_TI_symbol_name("_SlipCutSpeed")
	.dwattr $C$DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
	.dwattr $C$DW$569, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$569, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$569, DW_AT_decl_line(0x95)
	.dwattr $C$DW$569, DW_AT_decl_column(0x1a)
$C$DW$570	.dwtag  DW_TAG_member
	.dwattr $C$DW$570, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$570, DW_AT_name("CurrLimitPH")
	.dwattr $C$DW$570, DW_AT_TI_symbol_name("_CurrLimitPH")
	.dwattr $C$DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
	.dwattr $C$DW$570, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$570, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$570, DW_AT_decl_line(0x96)
	.dwattr $C$DW$570, DW_AT_decl_column(0x1a)
$C$DW$571	.dwtag  DW_TAG_member
	.dwattr $C$DW$571, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$571, DW_AT_name("CurrLimitPL")
	.dwattr $C$DW$571, DW_AT_TI_symbol_name("_CurrLimitPL")
	.dwattr $C$DW$571, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
	.dwattr $C$DW$571, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$571, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$571, DW_AT_decl_line(0x97)
	.dwattr $C$DW$571, DW_AT_decl_column(0x1a)
$C$DW$572	.dwtag  DW_TAG_member
	.dwattr $C$DW$572, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$572, DW_AT_name("Rsv712")
	.dwattr $C$DW$572, DW_AT_TI_symbol_name("_Rsv712")
	.dwattr $C$DW$572, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
	.dwattr $C$DW$572, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$572, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$572, DW_AT_decl_line(0x98)
	.dwattr $C$DW$572, DW_AT_decl_column(0x1a)
$C$DW$573	.dwtag  DW_TAG_member
	.dwattr $C$DW$573, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$573, DW_AT_name("Rsv713")
	.dwattr $C$DW$573, DW_AT_TI_symbol_name("_Rsv713")
	.dwattr $C$DW$573, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
	.dwattr $C$DW$573, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$573, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$573, DW_AT_decl_line(0x99)
	.dwattr $C$DW$573, DW_AT_decl_column(0x1a)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$574, DW_AT_name("Rsv714")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_Rsv714")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$574, DW_AT_decl_column(0x1a)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$575, DW_AT_name("Rsv715")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("_Rsv715")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$575, DW_AT_decl_column(0x1a)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$576, DW_AT_name("Rsv716")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("_Rsv716")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$576, DW_AT_decl_column(0x1a)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$577, DW_AT_name("Mscorrect")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("_Mscorrect")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$577, DW_AT_decl_column(0x1a)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$578, DW_AT_name("StopMode")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("_StopMode")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$578, DW_AT_decl_column(0x1a)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$579, DW_AT_name("CarrierFrq")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("_CarrierFrq")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$579, DW_AT_decl_column(0x1a)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$580, DW_AT_name("PWMMode")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("_PWMMode")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$580, DW_AT_decl_column(0x1a)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$581, DW_AT_name("ACRSlt")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("_ACRSlt")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$581, DW_AT_decl_column(0x1a)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$582, DW_AT_name("ACRP")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("_ACRP")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$582, DW_AT_decl_column(0x1a)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$583, DW_AT_name("ACRI")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("_ACRI")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$583, DW_AT_decl_column(0x1a)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$584, DW_AT_name("FanControl")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("_FanControl")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$584, DW_AT_decl_column(0x1a)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$585, DW_AT_name("DeltaFrqComVolt")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("_DeltaFrqComVolt")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$585, DW_AT_decl_column(0x1a)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$586, DW_AT_name("PreExcitTime")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("_PreExcitTime")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$586, DW_AT_decl_column(0x1a)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$587, DW_AT_name("DCLinkCtrlVoltSet")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("_DCLinkCtrlVoltSet")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$587, DW_AT_decl_column(0x1a)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$588, DW_AT_name("DCLinkCtrl_Pgain")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("_DCLinkCtrl_Pgain")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x102]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$588, DW_AT_decl_column(0x1a)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$589, DW_AT_name("DCLinkCtrl_Itime")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("_DCLinkCtrl_Itime")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0xa9)
	.dwattr $C$DW$589, DW_AT_decl_column(0x1a)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$590, DW_AT_name("FluxCtrl_Pgain")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("_FluxCtrl_Pgain")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x106]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$590, DW_AT_decl_column(0x1a)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$591, DW_AT_name("FluxCtrl_Itime")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("_FluxCtrl_Itime")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x108]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0xab)
	.dwattr $C$DW$591, DW_AT_decl_column(0x1a)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$592, DW_AT_name("SmWeakenCurr")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("_SmWeakenCurr")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x10a]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0xac)
	.dwattr $C$DW$592, DW_AT_decl_column(0x1a)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$593, DW_AT_name("PWMIndexMax")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("_PWMIndexMax")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x10c]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0xad)
	.dwattr $C$DW$593, DW_AT_decl_column(0x1a)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$594, DW_AT_name("PwmIndexLimit")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("_PwmIndexLimit")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x10e]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0xae)
	.dwattr $C$DW$594, DW_AT_decl_column(0x1a)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$595, DW_AT_name("RelucTorqAngle")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("_RelucTorqAngle")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0x110]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$595, DW_AT_decl_column(0x1a)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$596, DW_AT_name("P1229")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("_P1229")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x112]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$596, DW_AT_decl_column(0x1a)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$597, DW_AT_name("Pr1")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("_Pr1")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$597, DW_AT_decl_column(0x1a)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$598, DW_AT_name("Pr2")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("_Pr2")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x116]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$598, DW_AT_decl_column(0x1a)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$599, DW_AT_name("Pr3")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("_Pr3")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x118]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$599, DW_AT_decl_column(0x1a)
$C$DW$600	.dwtag  DW_TAG_member
	.dwattr $C$DW$600, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$600, DW_AT_name("Pr4")
	.dwattr $C$DW$600, DW_AT_TI_symbol_name("_Pr4")
	.dwattr $C$DW$600, DW_AT_data_member_location[DW_OP_plus_uconst 0x11a]
	.dwattr $C$DW$600, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$600, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$600, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$600, DW_AT_decl_column(0x1a)
$C$DW$601	.dwtag  DW_TAG_member
	.dwattr $C$DW$601, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$601, DW_AT_name("Pr5")
	.dwattr $C$DW$601, DW_AT_TI_symbol_name("_Pr5")
	.dwattr $C$DW$601, DW_AT_data_member_location[DW_OP_plus_uconst 0x11c]
	.dwattr $C$DW$601, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$601, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$601, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$601, DW_AT_decl_column(0x1a)
$C$DW$602	.dwtag  DW_TAG_member
	.dwattr $C$DW$602, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$602, DW_AT_name("DisPr1")
	.dwattr $C$DW$602, DW_AT_TI_symbol_name("_DisPr1")
	.dwattr $C$DW$602, DW_AT_data_member_location[DW_OP_plus_uconst 0x11e]
	.dwattr $C$DW$602, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$602, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$602, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$602, DW_AT_decl_column(0x1a)
$C$DW$603	.dwtag  DW_TAG_member
	.dwattr $C$DW$603, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$603, DW_AT_name("DisPr2")
	.dwattr $C$DW$603, DW_AT_TI_symbol_name("_DisPr2")
	.dwattr $C$DW$603, DW_AT_data_member_location[DW_OP_plus_uconst 0x120]
	.dwattr $C$DW$603, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$603, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$603, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$603, DW_AT_decl_column(0x1a)
$C$DW$604	.dwtag  DW_TAG_member
	.dwattr $C$DW$604, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$604, DW_AT_name("DisPr3")
	.dwattr $C$DW$604, DW_AT_TI_symbol_name("_DisPr3")
	.dwattr $C$DW$604, DW_AT_data_member_location[DW_OP_plus_uconst 0x122]
	.dwattr $C$DW$604, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$604, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$604, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$604, DW_AT_decl_column(0x1a)
$C$DW$605	.dwtag  DW_TAG_member
	.dwattr $C$DW$605, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$605, DW_AT_name("DisPr4")
	.dwattr $C$DW$605, DW_AT_TI_symbol_name("_DisPr4")
	.dwattr $C$DW$605, DW_AT_data_member_location[DW_OP_plus_uconst 0x124]
	.dwattr $C$DW$605, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$605, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$605, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$605, DW_AT_decl_column(0x1a)
$C$DW$606	.dwtag  DW_TAG_member
	.dwattr $C$DW$606, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$606, DW_AT_name("DisPr5")
	.dwattr $C$DW$606, DW_AT_TI_symbol_name("_DisPr5")
	.dwattr $C$DW$606, DW_AT_data_member_location[DW_OP_plus_uconst 0x126]
	.dwattr $C$DW$606, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$606, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$606, DW_AT_decl_line(0xba)
	.dwattr $C$DW$606, DW_AT_decl_column(0x1a)
$C$DW$607	.dwtag  DW_TAG_member
	.dwattr $C$DW$607, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$607, DW_AT_name("CANBand")
	.dwattr $C$DW$607, DW_AT_TI_symbol_name("_CANBand")
	.dwattr $C$DW$607, DW_AT_data_member_location[DW_OP_plus_uconst 0x128]
	.dwattr $C$DW$607, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$607, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$607, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$607, DW_AT_decl_column(0x1a)
$C$DW$608	.dwtag  DW_TAG_member
	.dwattr $C$DW$608, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$608, DW_AT_name("CANAddress")
	.dwattr $C$DW$608, DW_AT_TI_symbol_name("_CANAddress")
	.dwattr $C$DW$608, DW_AT_data_member_location[DW_OP_plus_uconst 0x12a]
	.dwattr $C$DW$608, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$608, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$608, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$608, DW_AT_decl_column(0x1a)
$C$DW$609	.dwtag  DW_TAG_member
	.dwattr $C$DW$609, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$609, DW_AT_name("CANOverTime")
	.dwattr $C$DW$609, DW_AT_TI_symbol_name("_CANOverTime")
	.dwattr $C$DW$609, DW_AT_data_member_location[DW_OP_plus_uconst 0x12c]
	.dwattr $C$DW$609, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$609, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$609, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$609, DW_AT_decl_column(0x1a)
$C$DW$610	.dwtag  DW_TAG_member
	.dwattr $C$DW$610, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$610, DW_AT_name("CANDiaPeriod")
	.dwattr $C$DW$610, DW_AT_TI_symbol_name("_CANDiaPeriod")
	.dwattr $C$DW$610, DW_AT_data_member_location[DW_OP_plus_uconst 0x12e]
	.dwattr $C$DW$610, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$610, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$610, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$610, DW_AT_decl_column(0x1a)
$C$DW$611	.dwtag  DW_TAG_member
	.dwattr $C$DW$611, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$611, DW_AT_name("CANCtrl")
	.dwattr $C$DW$611, DW_AT_TI_symbol_name("_CANCtrl")
	.dwattr $C$DW$611, DW_AT_data_member_location[DW_OP_plus_uconst 0x130]
	.dwattr $C$DW$611, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$611, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$611, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$611, DW_AT_decl_column(0x1a)
$C$DW$612	.dwtag  DW_TAG_member
	.dwattr $C$DW$612, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$612, DW_AT_name("CANSpeedRef")
	.dwattr $C$DW$612, DW_AT_TI_symbol_name("_CANSpeedRef")
	.dwattr $C$DW$612, DW_AT_data_member_location[DW_OP_plus_uconst 0x132]
	.dwattr $C$DW$612, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$612, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$612, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$612, DW_AT_decl_column(0x1a)
$C$DW$613	.dwtag  DW_TAG_member
	.dwattr $C$DW$613, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$613, DW_AT_name("CANTorqueRef")
	.dwattr $C$DW$613, DW_AT_TI_symbol_name("_CANTorqueRef")
	.dwattr $C$DW$613, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
	.dwattr $C$DW$613, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$613, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$613, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$613, DW_AT_decl_column(0x1a)
$C$DW$614	.dwtag  DW_TAG_member
	.dwattr $C$DW$614, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$614, DW_AT_name("MCUState")
	.dwattr $C$DW$614, DW_AT_TI_symbol_name("_MCUState")
	.dwattr $C$DW$614, DW_AT_data_member_location[DW_OP_plus_uconst 0x136]
	.dwattr $C$DW$614, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$614, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$614, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$614, DW_AT_decl_column(0x1a)
$C$DW$615	.dwtag  DW_TAG_member
	.dwattr $C$DW$615, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$615, DW_AT_name("AlarmDis")
	.dwattr $C$DW$615, DW_AT_TI_symbol_name("_AlarmDis")
	.dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x138]
	.dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$615, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$615, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$615, DW_AT_decl_column(0x1a)
$C$DW$616	.dwtag  DW_TAG_member
	.dwattr $C$DW$616, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$616, DW_AT_name("ErrorListH")
	.dwattr $C$DW$616, DW_AT_TI_symbol_name("_ErrorListH")
	.dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x13a]
	.dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$616, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$616, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$616, DW_AT_decl_column(0x1a)
$C$DW$617	.dwtag  DW_TAG_member
	.dwattr $C$DW$617, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$617, DW_AT_name("ErrorListL")
	.dwattr $C$DW$617, DW_AT_TI_symbol_name("_ErrorListL")
	.dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x13c]
	.dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$617, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$617, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$617, DW_AT_decl_column(0x1a)
$C$DW$618	.dwtag  DW_TAG_member
	.dwattr $C$DW$618, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$618, DW_AT_name("AlarmCode")
	.dwattr $C$DW$618, DW_AT_TI_symbol_name("_AlarmCode")
	.dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x13e]
	.dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$618, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$618, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$618, DW_AT_decl_column(0x1a)
$C$DW$619	.dwtag  DW_TAG_member
	.dwattr $C$DW$619, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$619, DW_AT_name("WarnCode")
	.dwattr $C$DW$619, DW_AT_TI_symbol_name("_WarnCode")
	.dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x140]
	.dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$619, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$619, DW_AT_decl_line(0xc7)
	.dwattr $C$DW$619, DW_AT_decl_column(0x1a)
$C$DW$620	.dwtag  DW_TAG_member
	.dwattr $C$DW$620, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$620, DW_AT_name("ErrNumber")
	.dwattr $C$DW$620, DW_AT_TI_symbol_name("_ErrNumber")
	.dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x142]
	.dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$620, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$620, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$620, DW_AT_decl_column(0x1a)
$C$DW$621	.dwtag  DW_TAG_member
	.dwattr $C$DW$621, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$621, DW_AT_name("ErrorCode")
	.dwattr $C$DW$621, DW_AT_TI_symbol_name("_ErrorCode")
	.dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x144]
	.dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$621, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$621, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$621, DW_AT_decl_column(0x1a)
$C$DW$622	.dwtag  DW_TAG_member
	.dwattr $C$DW$622, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$622, DW_AT_name("ErrDCVoltage")
	.dwattr $C$DW$622, DW_AT_TI_symbol_name("_ErrDCVoltage")
	.dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x146]
	.dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$622, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$622, DW_AT_decl_line(0xca)
	.dwattr $C$DW$622, DW_AT_decl_column(0x1a)
$C$DW$623	.dwtag  DW_TAG_member
	.dwattr $C$DW$623, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$623, DW_AT_name("ErrDCCur")
	.dwattr $C$DW$623, DW_AT_TI_symbol_name("_ErrDCCur")
	.dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x148]
	.dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$623, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$623, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$623, DW_AT_decl_column(0x1a)
$C$DW$624	.dwtag  DW_TAG_member
	.dwattr $C$DW$624, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$624, DW_AT_name("ErrVmsCtrl")
	.dwattr $C$DW$624, DW_AT_TI_symbol_name("_ErrVmsCtrl")
	.dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x14a]
	.dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$624, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$624, DW_AT_decl_line(0xcc)
	.dwattr $C$DW$624, DW_AT_decl_column(0x1a)
$C$DW$625	.dwtag  DW_TAG_member
	.dwattr $C$DW$625, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$625, DW_AT_name("ErrMCUState")
	.dwattr $C$DW$625, DW_AT_TI_symbol_name("_ErrMCUState")
	.dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x14c]
	.dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$625, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$625, DW_AT_decl_line(0xcd)
	.dwattr $C$DW$625, DW_AT_decl_column(0x1a)
$C$DW$626	.dwtag  DW_TAG_member
	.dwattr $C$DW$626, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$626, DW_AT_name("ErrTorqueCmd")
	.dwattr $C$DW$626, DW_AT_TI_symbol_name("_ErrTorqueCmd")
	.dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x14e]
	.dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$626, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$626, DW_AT_decl_line(0xce)
	.dwattr $C$DW$626, DW_AT_decl_column(0x1a)
$C$DW$627	.dwtag  DW_TAG_member
	.dwattr $C$DW$627, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$627, DW_AT_name("ErrTorqueFed")
	.dwattr $C$DW$627, DW_AT_TI_symbol_name("_ErrTorqueFed")
	.dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x150]
	.dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$627, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$627, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$627, DW_AT_decl_column(0x1a)
$C$DW$628	.dwtag  DW_TAG_member
	.dwattr $C$DW$628, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$628, DW_AT_name("ErrOutFreq")
	.dwattr $C$DW$628, DW_AT_TI_symbol_name("_ErrOutFreq")
	.dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x152]
	.dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$628, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$628, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$628, DW_AT_decl_column(0x1a)
$C$DW$629	.dwtag  DW_TAG_member
	.dwattr $C$DW$629, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$629, DW_AT_name("ErrSpeed")
	.dwattr $C$DW$629, DW_AT_TI_symbol_name("_ErrSpeed")
	.dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x154]
	.dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$629, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$629, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$629, DW_AT_decl_column(0x1a)
$C$DW$630	.dwtag  DW_TAG_member
	.dwattr $C$DW$630, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$630, DW_AT_name("ErrMCUTemp")
	.dwattr $C$DW$630, DW_AT_TI_symbol_name("_ErrMCUTemp")
	.dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x156]
	.dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$630, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$630, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$630, DW_AT_decl_column(0x1a)
$C$DW$631	.dwtag  DW_TAG_member
	.dwattr $C$DW$631, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$631, DW_AT_name("ErrMotorTemp")
	.dwattr $C$DW$631, DW_AT_TI_symbol_name("_ErrMotorTemp")
	.dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x158]
	.dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$631, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$631, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$631, DW_AT_decl_column(0x1a)
$C$DW$632	.dwtag  DW_TAG_member
	.dwattr $C$DW$632, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$632, DW_AT_name("ErrUd")
	.dwattr $C$DW$632, DW_AT_TI_symbol_name("_ErrUd")
	.dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x15a]
	.dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$632, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$632, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$632, DW_AT_decl_column(0x1a)
$C$DW$633	.dwtag  DW_TAG_member
	.dwattr $C$DW$633, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$633, DW_AT_name("ErrUq")
	.dwattr $C$DW$633, DW_AT_TI_symbol_name("_ErrUq")
	.dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x15c]
	.dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$633, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$633, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$633, DW_AT_decl_column(0x1a)
$C$DW$634	.dwtag  DW_TAG_member
	.dwattr $C$DW$634, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$634, DW_AT_name("ErrIdRef")
	.dwattr $C$DW$634, DW_AT_TI_symbol_name("_ErrIdRef")
	.dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x15e]
	.dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$634, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$634, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$634, DW_AT_decl_column(0x1a)
$C$DW$635	.dwtag  DW_TAG_member
	.dwattr $C$DW$635, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$635, DW_AT_name("ErrIqRef")
	.dwattr $C$DW$635, DW_AT_TI_symbol_name("_ErrIqRef")
	.dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x160]
	.dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$635, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$635, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$635, DW_AT_decl_column(0x1a)
$C$DW$636	.dwtag  DW_TAG_member
	.dwattr $C$DW$636, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$636, DW_AT_name("ErrIdFed")
	.dwattr $C$DW$636, DW_AT_TI_symbol_name("_ErrIdFed")
	.dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0x162]
	.dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$636, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$636, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$636, DW_AT_decl_column(0x1a)
$C$DW$637	.dwtag  DW_TAG_member
	.dwattr $C$DW$637, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$637, DW_AT_name("ErrIqFed")
	.dwattr $C$DW$637, DW_AT_TI_symbol_name("_ErrIqFed")
	.dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x164]
	.dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$637, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$637, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$637, DW_AT_decl_column(0x1a)
$C$DW$638	.dwtag  DW_TAG_member
	.dwattr $C$DW$638, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$638, DW_AT_name("Err12V")
	.dwattr $C$DW$638, DW_AT_TI_symbol_name("_Err12V")
	.dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x166]
	.dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$638, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$638, DW_AT_decl_line(0xda)
	.dwattr $C$DW$638, DW_AT_decl_column(0x1a)
$C$DW$639	.dwtag  DW_TAG_member
	.dwattr $C$DW$639, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$639, DW_AT_name("ErrStateH")
	.dwattr $C$DW$639, DW_AT_TI_symbol_name("_ErrStateH")
	.dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x168]
	.dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$639, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$639, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$639, DW_AT_decl_column(0x1a)
$C$DW$640	.dwtag  DW_TAG_member
	.dwattr $C$DW$640, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$640, DW_AT_name("ErrStateL")
	.dwattr $C$DW$640, DW_AT_TI_symbol_name("_ErrStateL")
	.dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x16a]
	.dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$640, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$640, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$640, DW_AT_decl_column(0x1a)
$C$DW$641	.dwtag  DW_TAG_member
	.dwattr $C$DW$641, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$641, DW_AT_name("ErrCurrent")
	.dwattr $C$DW$641, DW_AT_TI_symbol_name("_ErrCurrent")
	.dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$641, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$641, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$641, DW_AT_decl_column(0x1a)
$C$DW$642	.dwtag  DW_TAG_member
	.dwattr $C$DW$642, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$642, DW_AT_name("ErrMDISts")
	.dwattr $C$DW$642, DW_AT_TI_symbol_name("_ErrMDISts")
	.dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x16e]
	.dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$642, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$642, DW_AT_decl_line(0xde)
	.dwattr $C$DW$642, DW_AT_decl_column(0x1a)
$C$DW$643	.dwtag  DW_TAG_member
	.dwattr $C$DW$643, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$643, DW_AT_name("RSV28")
	.dwattr $C$DW$643, DW_AT_TI_symbol_name("_RSV28")
	.dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x170]
	.dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$643, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$643, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$643, DW_AT_decl_column(0x1a)
$C$DW$644	.dwtag  DW_TAG_member
	.dwattr $C$DW$644, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$644, DW_AT_name("RSV29")
	.dwattr $C$DW$644, DW_AT_TI_symbol_name("_RSV29")
	.dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x172]
	.dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$644, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$644, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$644, DW_AT_decl_column(0x1a)
$C$DW$645	.dwtag  DW_TAG_member
	.dwattr $C$DW$645, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$645, DW_AT_name("RSV30")
	.dwattr $C$DW$645, DW_AT_TI_symbol_name("_RSV30")
	.dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$645, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$645, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$645, DW_AT_decl_column(0x1a)
$C$DW$646	.dwtag  DW_TAG_member
	.dwattr $C$DW$646, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$646, DW_AT_name("ErrHour")
	.dwattr $C$DW$646, DW_AT_TI_symbol_name("_ErrHour")
	.dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x176]
	.dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$646, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$646, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$646, DW_AT_decl_column(0x1a)
$C$DW$647	.dwtag  DW_TAG_member
	.dwattr $C$DW$647, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$647, DW_AT_name("ErrSecond")
	.dwattr $C$DW$647, DW_AT_TI_symbol_name("_ErrSecond")
	.dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x178]
	.dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$647, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$647, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$647, DW_AT_decl_column(0x1a)
$C$DW$648	.dwtag  DW_TAG_member
	.dwattr $C$DW$648, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$648, DW_AT_name("ErrMs")
	.dwattr $C$DW$648, DW_AT_TI_symbol_name("_ErrMs")
	.dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0x17a]
	.dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$648, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$648, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$648, DW_AT_decl_column(0x1a)
$C$DW$649	.dwtag  DW_TAG_member
	.dwattr $C$DW$649, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$649, DW_AT_name("RSV34")
	.dwattr $C$DW$649, DW_AT_TI_symbol_name("_RSV34")
	.dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$649, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$649, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$649, DW_AT_decl_column(0x1a)
$C$DW$650	.dwtag  DW_TAG_member
	.dwattr $C$DW$650, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$650, DW_AT_name("SerialNum")
	.dwattr $C$DW$650, DW_AT_TI_symbol_name("_SerialNum")
	.dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x17e]
	.dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$650, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$650, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$650, DW_AT_decl_column(0x1a)
$C$DW$651	.dwtag  DW_TAG_member
	.dwattr $C$DW$651, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$651, DW_AT_name("SoftWareVer")
	.dwattr $C$DW$651, DW_AT_TI_symbol_name("_SoftWareVer")
	.dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
	.dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$651, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$651, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$651, DW_AT_decl_column(0x1a)
$C$DW$652	.dwtag  DW_TAG_member
	.dwattr $C$DW$652, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$652, DW_AT_name("RatedCurrent")
	.dwattr $C$DW$652, DW_AT_TI_symbol_name("_RatedCurrent")
	.dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x182]
	.dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$652, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$652, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$652, DW_AT_decl_column(0x1a)
$C$DW$653	.dwtag  DW_TAG_member
	.dwattr $C$DW$653, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$653, DW_AT_name("MaxConVoltage")
	.dwattr $C$DW$653, DW_AT_TI_symbol_name("_MaxConVoltage")
	.dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$653, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$653, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$653, DW_AT_decl_column(0x1a)
$C$DW$654	.dwtag  DW_TAG_member
