;***************************************************************
;* TMS320C2000 C/C++ Codegen                         PC v5.2.1 *
;* Date/Time created: Wed Jul 24 10:06:07 2019                 *
;***************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --quiet --silicon_version=28 --symdebug:dwarf 
FP	.set	XAR2

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("SpeedFunc.c")
	.dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v5.2.1 Copyright (c) 1996-2009 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("F:\Drive0X\trunk\16-PEU11C33\03-C33M07-ABS\app\source")

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("FuncManage_ClearRunStsAndCmd")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("_FuncManage_ClearRunStsAndCmd")
	.dwattr $C$DW$1, DW_AT_declaration
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("../include/Command.h")
	.dwattr $C$DW$1, DW_AT_decl_line(0x11)
	.dwattr $C$DW$1, DW_AT_decl_column(0x13)

$C$DW$2	.dwtag  DW_TAG_subprogram, DW_AT_name("ForceTZ")
	.dwattr $C$DW$2, DW_AT_TI_symbol_name("_ForceTZ")
	.dwattr $C$DW$2, DW_AT_declaration
	.dwattr $C$DW$2, DW_AT_external
	.dwattr $C$DW$2, DW_AT_decl_file("../include/Ev72ctrl.h")
	.dwattr $C$DW$2, DW_AT_decl_line(0x90)
	.dwattr $C$DW$2, DW_AT_decl_column(0x16)
	.global	_uAccDecFlag
_uAccDecFlag:	.usect	".ebss",1,1,0

	.dwattr $C$DW$T$632, DW_AT_decl_file("../include/IQmathLib.h")
	.dwattr $C$DW$T$632, DW_AT_decl_line(0x85)
	.dwattr $C$DW$T$632, DW_AT_decl_column(0x13)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$94, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$94, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$94, DW_AT_decl_column(0x19)

$C$DW$T$397	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$397, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$397, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$397, DW_AT_byte_size(0x04)
$C$DW$171	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$171, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$397


$C$DW$T$398	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$398, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$398, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$398, DW_AT_byte_size(0x0c)
$C$DW$172	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$172, DW_AT_upper_bound(0x05)
	.dwendtag $C$DW$T$398


$C$DW$T$399	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$399, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$T$399, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$399, DW_AT_byte_size(0x08)
$C$DW$173	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$173, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$399

$C$DW$T$508	.dwtag  DW_TAG_typedef, DW_AT_name("uword")
	.dwattr $C$DW$T$508, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$508, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$508, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$508, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$508, DW_AT_decl_column(0x19)
$C$DW$T$513	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$513, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$513, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$513, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$513, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$513, DW_AT_decl_column(0x19)
$C$DW$T$559	.dwtag  DW_TAG_typedef, DW_AT_name("uint32")
	.dwattr $C$DW$T$559, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$559, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$559, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$559, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$559, DW_AT_decl_column(0x19)
$C$DW$T$633	.dwtag  DW_TAG_typedef, DW_AT_name("WORD")
	.dwattr $C$DW$T$633, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$633, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$633, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$633, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$633, DW_AT_decl_column(0x1b)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
$C$DW$T$634	.dwtag  DW_TAG_typedef, DW_AT_name("int64")
	.dwattr $C$DW$T$634, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$634, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$634, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$634, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$634, DW_AT_decl_column(0x1a)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
$C$DW$T$635	.dwtag  DW_TAG_typedef, DW_AT_name("Uint64")
	.dwattr $C$DW$T$635, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$635, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$635, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$635, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$635, DW_AT_decl_column(0x1d)
$C$DW$T$636	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$636, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$636, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$636, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$636, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$636, DW_AT_decl_column(0x1e)
$C$DW$T$637	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$637, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$637, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$637, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$637, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$637, DW_AT_decl_column(0x1e)
$C$DW$T$638	.dwtag  DW_TAG_typedef, DW_AT_name("QWORD")
	.dwattr $C$DW$T$638, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$638, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$638, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$638, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$638, DW_AT_decl_column(0x1e)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$639	.dwtag  DW_TAG_typedef, DW_AT_name("float32")
	.dwattr $C$DW$T$639, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$639, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$639, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$639, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$639, DW_AT_decl_column(0x1a)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
$C$DW$T$640	.dwtag  DW_TAG_typedef, DW_AT_name("float64")
	.dwattr $C$DW$T$640, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$T$640, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$640, DW_AT_decl_file("..\include\Typedefs.h")
	.dwattr $C$DW$T$640, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$640, DW_AT_decl_column(0x1a)

$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_byte_size(0x01)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$174, DW_AT_name("RefChannel")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_RefChannel")
	.dwattr $C$DW$174, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x94)
	.dwattr $C$DW$174, DW_AT_decl_column(0x11)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$175, DW_AT_name("AuxRefChannel")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_AuxRefChannel")
	.dwattr $C$DW$175, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x95)
	.dwattr $C$DW$175, DW_AT_decl_column(0x11)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$176, DW_AT_name("TorqToSpdTerm")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_TorqToSpdTerm")
	.dwattr $C$DW$176, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x96)
	.dwattr $C$DW$176, DW_AT_decl_column(0x11)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$177, DW_AT_name("Torq2TorqCurrTerm")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_Torq2TorqCurrTerm")
	.dwattr $C$DW$177, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x97)
	.dwattr $C$DW$177, DW_AT_decl_column(0x11)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$178, DW_AT_name("HoldAITBiasTerm")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_HoldAITBiasTerm")
	.dwattr $C$DW$178, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x98)
	.dwattr $C$DW$178, DW_AT_decl_column(0x11)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$179, DW_AT_name("TermJogFWD")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_TermJogFWD")
	.dwattr $C$DW$179, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$179, DW_AT_decl_column(0x11)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$180, DW_AT_name("TermJogREV")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_TermJogREV")
	.dwattr $C$DW$180, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$180, DW_AT_decl_column(0x11)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$181, DW_AT_name("SciJogFWD")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_SciJogFWD")
	.dwattr $C$DW$181, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$181, DW_AT_decl_column(0x11)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$182, DW_AT_name("SciJogREV")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_SciJogREV")
	.dwattr $C$DW$182, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$182, DW_AT_decl_column(0x11)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$183, DW_AT_name("KBUP")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_KBUP")
	.dwattr $C$DW$183, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$183, DW_AT_decl_column(0x11)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$184, DW_AT_name("KBDN")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_KBDN")
	.dwattr $C$DW$184, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$184, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x93)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x01)
$C$DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopCmdBK2")
	.dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$20, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x02)

$C$DW$T$21	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$185, DW_AT_name("all")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$185, DW_AT_decl_column(0x13)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$186, DW_AT_name("bit")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$186, DW_AT_decl_column(0x12)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x01)
$C$DW$T$641	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopCmdBK2")
	.dwattr $C$DW$T$641, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$641, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$641, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$641, DW_AT_decl_line(0xa8)
	.dwattr $C$DW$T$641, DW_AT_decl_column(0x02)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$187, DW_AT_name("RunDirect")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_RunDirect")
	.dwattr $C$DW$187, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$187, DW_AT_decl_column(0x11)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$188, DW_AT_name("RunCmd")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_RunCmd")
	.dwattr $C$DW$188, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0xca)
	.dwattr $C$DW$188, DW_AT_decl_column(0x11)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$189, DW_AT_name("ForbitRun")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_ForbitRun")
	.dwattr $C$DW$189, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$189, DW_AT_decl_column(0x11)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$190, DW_AT_name("RSV3")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_RSV3")
	.dwattr $C$DW$190, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0xce)
	.dwattr $C$DW$190, DW_AT_decl_column(0x11)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$191, DW_AT_name("RSV4")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_RSV4")
	.dwattr $C$DW$191, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0xcf)
	.dwattr $C$DW$191, DW_AT_decl_column(0x11)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$192, DW_AT_name("EmergStop")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_EmergStop")
	.dwattr $C$DW$192, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$192, DW_AT_decl_column(0x11)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$193, DW_AT_name("FreeStop")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_FreeStop")
	.dwattr $C$DW$193, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$193, DW_AT_decl_column(0x11)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$194, DW_AT_name("RSV7")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSV7")
	.dwattr $C$DW$194, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0xd2)
	.dwattr $C$DW$194, DW_AT_decl_column(0x11)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$195, DW_AT_name("RSV8")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_RSV8")
	.dwattr $C$DW$195, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$195, DW_AT_decl_column(0x11)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$196, DW_AT_name("RSV9")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSV9")
	.dwattr $C$DW$196, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0xd4)
	.dwattr $C$DW$196, DW_AT_decl_column(0x11)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$197, DW_AT_name("RSV10")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_RSV10")
	.dwattr $C$DW$197, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0xd5)
	.dwattr $C$DW$197, DW_AT_decl_column(0x11)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$198, DW_AT_name("RSV11")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSV11")
	.dwattr $C$DW$198, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$198, DW_AT_decl_column(0x11)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$199, DW_AT_name("RSV12")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_RSV12")
	.dwattr $C$DW$199, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$199, DW_AT_decl_column(0x11)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$200, DW_AT_name("ForceStop")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_ForceStop")
	.dwattr $C$DW$200, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$200, DW_AT_decl_column(0x11)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$201, DW_AT_name("RSV14")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_RSV14")
	.dwattr $C$DW$201, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$201, DW_AT_decl_column(0x11)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$202, DW_AT_name("RestErr")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_RestErr")
	.dwattr $C$DW$202, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0xda)
	.dwattr $C$DW$202, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0xc8)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x01)
$C$DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("S_CtrlCmd1")
	.dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$23, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x02)

$C$DW$T$24	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$203, DW_AT_name("all")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0xe0)
	.dwattr $C$DW$203, DW_AT_decl_column(0x12)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$204, DW_AT_name("bit")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0xe1)
	.dwattr $C$DW$204, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
$C$DW$T$642	.dwtag  DW_TAG_typedef, DW_AT_name("U_CtrlCmd1")
	.dwattr $C$DW$T$642, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$642, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$642, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$642, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$642, DW_AT_decl_column(0x02)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$205, DW_AT_name("CtlMode")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_CtlMode")
	.dwattr $C$DW$205, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0xec)
	.dwattr $C$DW$205, DW_AT_decl_column(0x11)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$206, DW_AT_name("Rsv2")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_Rsv2")
	.dwattr $C$DW$206, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0xf0)
	.dwattr $C$DW$206, DW_AT_decl_column(0x11)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$207, DW_AT_name("Rsv4")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_Rsv4")
	.dwattr $C$DW$207, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$207, DW_AT_decl_column(0x11)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$208, DW_AT_name("Rsv5")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_Rsv5")
	.dwattr $C$DW$208, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$208, DW_AT_decl_column(0x11)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$209, DW_AT_name("Rsv6")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_Rsv6")
	.dwattr $C$DW$209, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$209, DW_AT_decl_column(0x11)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$210, DW_AT_name("Rsv7")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_Rsv7")
	.dwattr $C$DW$210, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$210, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$210, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$210, DW_AT_decl_column(0x11)
$C$DW$211	.dwtag  DW_TAG_member
	.dwattr $C$DW$211, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$211, DW_AT_name("Rsv8")
	.dwattr $C$DW$211, DW_AT_TI_symbol_name("_Rsv8")
	.dwattr $C$DW$211, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$211, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$211, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$211, DW_AT_decl_column(0x11)
$C$DW$212	.dwtag  DW_TAG_member
	.dwattr $C$DW$212, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$212, DW_AT_name("Rsv10")
	.dwattr $C$DW$212, DW_AT_TI_symbol_name("_Rsv10")
	.dwattr $C$DW$212, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$212, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$212, DW_AT_decl_line(0xff)
	.dwattr $C$DW$212, DW_AT_decl_column(0x11)
$C$DW$213	.dwtag  DW_TAG_member
	.dwattr $C$DW$213, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$213, DW_AT_name("Rsv11")
	.dwattr $C$DW$213, DW_AT_TI_symbol_name("_Rsv11")
	.dwattr $C$DW$213, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$213, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$213, DW_AT_decl_line(0x100)
	.dwattr $C$DW$213, DW_AT_decl_column(0x11)
$C$DW$214	.dwtag  DW_TAG_member
	.dwattr $C$DW$214, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$214, DW_AT_name("Rsv12")
	.dwattr $C$DW$214, DW_AT_TI_symbol_name("_Rsv12")
	.dwattr $C$DW$214, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$214, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$214, DW_AT_decl_line(0x101)
	.dwattr $C$DW$214, DW_AT_decl_column(0x11)
$C$DW$215	.dwtag  DW_TAG_member
	.dwattr $C$DW$215, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$215, DW_AT_name("Rsv13")
	.dwattr $C$DW$215, DW_AT_TI_symbol_name("_Rsv13")
	.dwattr $C$DW$215, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$215, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$215, DW_AT_decl_line(0x102)
	.dwattr $C$DW$215, DW_AT_decl_column(0x11)
$C$DW$216	.dwtag  DW_TAG_member
	.dwattr $C$DW$216, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$216, DW_AT_name("Rsv14")
	.dwattr $C$DW$216, DW_AT_TI_symbol_name("_Rsv14")
	.dwattr $C$DW$216, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$216, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$216, DW_AT_decl_line(0x103)
	.dwattr $C$DW$216, DW_AT_decl_column(0x11)
$C$DW$217	.dwtag  DW_TAG_member
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$217, DW_AT_name("RunStopCmd")
	.dwattr $C$DW$217, DW_AT_TI_symbol_name("_RunStopCmd")
	.dwattr $C$DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$217, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$217, DW_AT_decl_line(0x104)
	.dwattr $C$DW$217, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
$C$DW$T$26	.dwtag  DW_TAG_typedef, DW_AT_name("S_CtrlCmd2")
	.dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$26, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x02)

$C$DW$T$27	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$218, DW_AT_name("all")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$218, DW_AT_decl_column(0x12)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$219, DW_AT_name("bit")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$219, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
$C$DW$T$643	.dwtag  DW_TAG_typedef, DW_AT_name("U_CtrlCmd2")
	.dwattr $C$DW$T$643, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$643, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$643, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$643, DW_AT_decl_line(0x10c)
	.dwattr $C$DW$T$643, DW_AT_decl_column(0x02)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$220, DW_AT_name("RunStatus")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_RunStatus")
	.dwattr $C$DW$220, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x129)
	.dwattr $C$DW$220, DW_AT_decl_column(0x11)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$221, DW_AT_name("OVSpeedHold")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_OVSpeedHold")
	.dwattr $C$DW$221, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$221, DW_AT_decl_column(0x11)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$222, DW_AT_name("OCSpeedHold")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_OCSpeedHold")
	.dwattr $C$DW$222, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$222, DW_AT_decl_column(0x11)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$223, DW_AT_name("HaveError")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_HaveError")
	.dwattr $C$DW$223, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$223, DW_AT_decl_column(0x11)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$224, DW_AT_name("DCBrakeIsOn")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_DCBrakeIsOn")
	.dwattr $C$DW$224, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$224, DW_AT_decl_column(0x11)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$225, DW_AT_name("PreExcitIsOn")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_PreExcitIsOn")
	.dwattr $C$DW$225, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x12e)
	.dwattr $C$DW$225, DW_AT_decl_column(0x11)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$226, DW_AT_name("SwitchToSpdMode")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_SwitchToSpdMode")
	.dwattr $C$DW$226, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$226, DW_AT_decl_column(0x11)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$227, DW_AT_name("StopDCBrakeIsOn")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_StopDCBrakeIsOn")
	.dwattr $C$DW$227, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x130)
	.dwattr $C$DW$227, DW_AT_decl_column(0x11)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$228, DW_AT_name("StallingIsOn")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_StallingIsOn")
	.dwattr $C$DW$228, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x131)
	.dwattr $C$DW$228, DW_AT_decl_column(0x11)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$229, DW_AT_name("TuningIsOK")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_TuningIsOK")
	.dwattr $C$DW$229, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x132)
	.dwattr $C$DW$229, DW_AT_decl_column(0x11)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$230, DW_AT_name("WritenMotorParaToROM")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_WritenMotorParaToROM")
	.dwattr $C$DW$230, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x133)
	.dwattr $C$DW$230, DW_AT_decl_column(0x11)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$231, DW_AT_name("PowerIsOK")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_PowerIsOK")
	.dwattr $C$DW$231, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x134)
	.dwattr $C$DW$231, DW_AT_decl_column(0x11)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$232, DW_AT_name("TorqueLimitIsOn")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_TorqueLimitIsOn")
	.dwattr $C$DW$232, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x135)
	.dwattr $C$DW$232, DW_AT_decl_column(0x11)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$233, DW_AT_name("TorqueIsNegative")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_TorqueIsNegative")
	.dwattr $C$DW$233, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x136)
	.dwattr $C$DW$233, DW_AT_decl_column(0x11)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$234, DW_AT_name("Spd2TorqIsFinished")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_Spd2TorqIsFinished")
	.dwattr $C$DW$234, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x137)
	.dwattr $C$DW$234, DW_AT_decl_column(0x11)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$235, DW_AT_name("MDIReady")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_MDIReady")
	.dwattr $C$DW$235, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x138)
	.dwattr $C$DW$235, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x128)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
$C$DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopStatus1")
	.dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$29, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x139)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x02)

$C$DW$T$30	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$236, DW_AT_name("all")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$236, DW_AT_decl_column(0x15)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$237, DW_AT_name("bit")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$237, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
$C$DW$T$644	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopStatus1")
	.dwattr $C$DW$T$644, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$644, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$644, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$644, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$644, DW_AT_decl_column(0x02)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$238, DW_AT_name("RuningStep")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_RuningStep")
	.dwattr $C$DW$238, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x144)
	.dwattr $C$DW$238, DW_AT_decl_column(0x11)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$239, DW_AT_name("CmdChannel")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_CmdChannel")
	.dwattr $C$DW$239, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x148)
	.dwattr $C$DW$239, DW_AT_decl_column(0x11)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$240, DW_AT_name("RefChannel")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_RefChannel")
	.dwattr $C$DW$240, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$240, DW_AT_decl_column(0x11)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$241, DW_AT_name("ErrIsSaved")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_ErrIsSaved")
	.dwattr $C$DW$241, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x158)
	.dwattr $C$DW$241, DW_AT_decl_column(0x11)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$242, DW_AT_name("ErrIsMemorized")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_ErrIsMemorized")
	.dwattr $C$DW$242, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x159)
	.dwattr $C$DW$242, DW_AT_decl_column(0x11)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$243, DW_AT_name("AutoRstErrIsON")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_AutoRstErrIsON")
	.dwattr $C$DW$243, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x15a)
	.dwattr $C$DW$243, DW_AT_decl_column(0x11)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$244, DW_AT_name("ErrFreqRefIsValid")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_ErrFreqRefIsValid")
	.dwattr $C$DW$244, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$244, DW_AT_decl_column(0x11)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$245, DW_AT_name("HaveErrLock")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_HaveErrLock")
	.dwattr $C$DW$245, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x15e)
	.dwattr $C$DW$245, DW_AT_decl_column(0x11)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$246, DW_AT_name("HavePreOLErr")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_HavePreOLErr")
	.dwattr $C$DW$246, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$246, DW_AT_decl_column(0x11)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$247, DW_AT_name("AutoRstAllErrIsON")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_AutoRstAllErrIsON")
	.dwattr $C$DW$247, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x160)
	.dwattr $C$DW$247, DW_AT_decl_column(0x11)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$248, DW_AT_name("HaveErrBeforePoff")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_HaveErrBeforePoff")
	.dwattr $C$DW$248, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x161)
	.dwattr $C$DW$248, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x143)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
$C$DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopStatus2")
	.dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$32, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x163)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x02)

$C$DW$T$33	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$249, DW_AT_name("all")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x168)
	.dwattr $C$DW$249, DW_AT_decl_column(0x15)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$250, DW_AT_name("bit")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x169)
	.dwattr $C$DW$250, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
$C$DW$T$645	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopStatus2")
	.dwattr $C$DW$T$645, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$645, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$645, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$645, DW_AT_decl_line(0x16a)
	.dwattr $C$DW$T$645, DW_AT_decl_column(0x02)

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$251, DW_AT_name("FreqHighLimit")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_FreqHighLimit")
	.dwattr $C$DW$251, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x16f)
	.dwattr $C$DW$251, DW_AT_decl_column(0x11)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$252, DW_AT_name("FreqLowLimit")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_FreqLowLimit")
	.dwattr $C$DW$252, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x170)
	.dwattr $C$DW$252, DW_AT_decl_column(0x11)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$253, DW_AT_name("ZeroSpeedRunning")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_ZeroSpeedRunning")
	.dwattr $C$DW$253, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x171)
	.dwattr $C$DW$253, DW_AT_decl_column(0x11)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$254, DW_AT_name("SpdBeingLimited")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_SpdBeingLimited")
	.dwattr $C$DW$254, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x172)
	.dwattr $C$DW$254, DW_AT_decl_column(0x11)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$255, DW_AT_name("TorqBeingLimited")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_TorqBeingLimited")
	.dwattr $C$DW$255, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x173)
	.dwattr $C$DW$255, DW_AT_decl_column(0x11)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$256, DW_AT_name("ZeroServoFinished")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_ZeroServoFinished")
	.dwattr $C$DW$256, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x174)
	.dwattr $C$DW$256, DW_AT_decl_column(0x11)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$257, DW_AT_name("AITorqBiasValid")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_AITorqBiasValid")
	.dwattr $C$DW$257, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x175)
	.dwattr $C$DW$257, DW_AT_decl_column(0x11)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$258, DW_AT_name("MAOFinished")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_MAOFinished")
	.dwattr $C$DW$258, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x176)
	.dwattr $C$DW$258, DW_AT_decl_column(0x11)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$259, DW_AT_name("SMotorBraker")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_SMotorBraker")
	.dwattr $C$DW$259, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x177)
	.dwattr $C$DW$259, DW_AT_decl_column(0x11)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$260, DW_AT_name("MtrSelect")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_MtrSelect")
	.dwattr $C$DW$260, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x178)
	.dwattr $C$DW$260, DW_AT_decl_column(0x11)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$261, DW_AT_name("MtrMode")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_MtrMode")
	.dwattr $C$DW$261, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x17b)
	.dwattr $C$DW$261, DW_AT_decl_column(0x11)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$262, DW_AT_name("MAOSpd1Reached")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_MAOSpd1Reached")
	.dwattr $C$DW$262, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x17e)
	.dwattr $C$DW$262, DW_AT_decl_column(0x11)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$263, DW_AT_name("Spd1To2PosReached")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_Spd1To2PosReached")
	.dwattr $C$DW$263, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$263, DW_AT_decl_column(0x11)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$264, DW_AT_name("MAOSpd2Reached")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_MAOSpd2Reached")
	.dwattr $C$DW$264, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x180)
	.dwattr $C$DW$264, DW_AT_decl_column(0x11)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$265, DW_AT_name("StartOrientPosReached")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_StartOrientPosReached")
	.dwattr $C$DW$265, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x181)
	.dwattr $C$DW$265, DW_AT_decl_column(0x11)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$266, DW_AT_name("StopSpdflag")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_StopSpdflag")
	.dwattr $C$DW$266, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x182)
	.dwattr $C$DW$266, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
$C$DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopStatus3")
	.dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$35, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x183)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x02)

$C$DW$T$36	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$267, DW_AT_name("all")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x187)
	.dwattr $C$DW$267, DW_AT_decl_column(0x15)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$268, DW_AT_name("bit")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x188)
	.dwattr $C$DW$268, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$36

	.dwattr $C$DW$T$36, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x186)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
$C$DW$T$646	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopStatus3")
	.dwattr $C$DW$T$646, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$646, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$646, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$646, DW_AT_decl_line(0x189)
	.dwattr $C$DW$T$646, DW_AT_decl_column(0x02)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$269, DW_AT_name("RunWaitIsOK")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_RunWaitIsOK")
	.dwattr $C$DW$269, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x18e)
	.dwattr $C$DW$269, DW_AT_decl_column(0x11)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$270, DW_AT_name("StartIsOK")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_StartIsOK")
	.dwattr $C$DW$270, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x18f)
	.dwattr $C$DW$270, DW_AT_decl_column(0x11)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$271, DW_AT_name("StopSpdIsReached")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_StopSpdIsReached")
	.dwattr $C$DW$271, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x190)
	.dwattr $C$DW$271, DW_AT_decl_column(0x11)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$272, DW_AT_name("StopDCBrakeIsOK")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_StopDCBrakeIsOK")
	.dwattr $C$DW$272, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x191)
	.dwattr $C$DW$272, DW_AT_decl_column(0x11)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$273, DW_AT_name("Fwd2RevIsSwitching")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_Fwd2RevIsSwitching")
	.dwattr $C$DW$273, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x192)
	.dwattr $C$DW$273, DW_AT_decl_column(0x11)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$274, DW_AT_name("SartDCBrakeIsOK")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_SartDCBrakeIsOK")
	.dwattr $C$DW$274, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x193)
	.dwattr $C$DW$274, DW_AT_decl_column(0x11)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$275, DW_AT_name("RunStopSts")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_RunStopSts")
	.dwattr $C$DW$275, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x194)
	.dwattr $C$DW$275, DW_AT_decl_column(0x11)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$276, DW_AT_name("RunAfterPoff")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_RunAfterPoff")
	.dwattr $C$DW$276, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x195)
	.dwattr $C$DW$276, DW_AT_decl_column(0x11)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$277, DW_AT_name("ErrFreqIsRefreshed")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_ErrFreqIsRefreshed")
	.dwattr $C$DW$277, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x196)
	.dwattr $C$DW$277, DW_AT_decl_column(0x11)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$278, DW_AT_name("SpdTorqIsOn")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_SpdTorqIsOn")
	.dwattr $C$DW$278, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x197)
	.dwattr $C$DW$278, DW_AT_decl_column(0x11)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$279, DW_AT_name("MtrPwrPolar")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_MtrPwrPolar")
	.dwattr $C$DW$279, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x198)
	.dwattr $C$DW$279, DW_AT_decl_column(0x11)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$280, DW_AT_name("FirstPowerOn")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_FirstPowerOn")
	.dwattr $C$DW$280, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x199)
	.dwattr $C$DW$280, DW_AT_decl_column(0x11)
$C$DW$281	.dwtag  DW_TAG_member
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$281, DW_AT_name("FirstJogRun")
	.dwattr $C$DW$281, DW_AT_TI_symbol_name("_FirstJogRun")
	.dwattr $C$DW$281, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$281, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$281, DW_AT_decl_line(0x19c)
	.dwattr $C$DW$281, DW_AT_decl_column(0x11)
$C$DW$282	.dwtag  DW_TAG_member
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$282, DW_AT_name("MotorRunDirect")
	.dwattr $C$DW$282, DW_AT_TI_symbol_name("_MotorRunDirect")
	.dwattr $C$DW$282, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$282, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$282, DW_AT_decl_line(0x19f)
	.dwattr $C$DW$282, DW_AT_decl_column(0x11)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$283, DW_AT_name("PreOLIsOn")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_PreOLIsOn")
	.dwattr $C$DW$283, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x1a1)
	.dwattr $C$DW$283, DW_AT_decl_column(0x11)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$284, DW_AT_name("PowerIsOn")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_PowerIsOn")
	.dwattr $C$DW$284, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x1a2)
	.dwattr $C$DW$284, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
$C$DW$T$38	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopStatus4")
	.dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$38, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x1a3)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x02)

$C$DW$T$39	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$285, DW_AT_name("all")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$285, DW_AT_decl_column(0x15)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$286, DW_AT_name("bit")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$286, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$39

	.dwattr $C$DW$T$39, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x1a6)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
$C$DW$T$647	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopStatus4")
	.dwattr $C$DW$T$647, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$647, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$647, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$647, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$T$647, DW_AT_decl_column(0x02)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$287, DW_AT_name("PLCStepFinished")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_PLCStepFinished")
	.dwattr $C$DW$287, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x1ae)
	.dwattr $C$DW$287, DW_AT_decl_column(0x11)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$288, DW_AT_name("PLCFinished")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_PLCFinished")
	.dwattr $C$DW$288, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x1af)
	.dwattr $C$DW$288, DW_AT_decl_column(0x11)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$289, DW_AT_name("SpinUpDnIsLimited")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_SpinUpDnIsLimited")
	.dwattr $C$DW$289, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x1b0)
	.dwattr $C$DW$289, DW_AT_decl_column(0x11)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$290, DW_AT_name("TorqPole")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_TorqPole")
	.dwattr $C$DW$290, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x1b1)
	.dwattr $C$DW$290, DW_AT_decl_column(0x11)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$291, DW_AT_name("OvBelowTorq1")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_OvBelowTorq1")
	.dwattr $C$DW$291, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x1b2)
	.dwattr $C$DW$291, DW_AT_decl_column(0x11)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$292, DW_AT_name("OvBelowTorq2")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_OvBelowTorq2")
	.dwattr $C$DW$292, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x1b3)
	.dwattr $C$DW$292, DW_AT_decl_column(0x11)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$293, DW_AT_name("OverSpdErr")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_OverSpdErr")
	.dwattr $C$DW$293, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x1b4)
	.dwattr $C$DW$293, DW_AT_decl_column(0x11)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$294, DW_AT_name("OverSpdRef")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_OverSpdRef")
	.dwattr $C$DW$294, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x1b6)
	.dwattr $C$DW$294, DW_AT_decl_column(0x11)
$C$DW$295	.dwtag  DW_TAG_member
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$295, DW_AT_name("PIDIsRunning")
	.dwattr $C$DW$295, DW_AT_TI_symbol_name("_PIDIsRunning")
	.dwattr $C$DW$295, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
	.dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$295, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$295, DW_AT_decl_line(0x1b8)
	.dwattr $C$DW$295, DW_AT_decl_column(0x11)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$296, DW_AT_name("PIDPreFreqIsReached")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_PIDPreFreqIsReached")
	.dwattr $C$DW$296, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x1b9)
	.dwattr $C$DW$296, DW_AT_decl_column(0x11)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$297, DW_AT_name("PIDIsDisabled")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_PIDIsDisabled")
	.dwattr $C$DW$297, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x1ba)
	.dwattr $C$DW$297, DW_AT_decl_column(0x11)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$298, DW_AT_name("PIDErrIsNeg")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_PIDErrIsNeg")
	.dwattr $C$DW$298, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x1bb)
	.dwattr $C$DW$298, DW_AT_decl_column(0x11)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$299, DW_AT_name("SpinIsRunning")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_SpinIsRunning")
	.dwattr $C$DW$299, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x1bc)
	.dwattr $C$DW$299, DW_AT_decl_column(0x11)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$300, DW_AT_name("PIDPeriodIsUnreached")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_PIDPeriodIsUnreached")
	.dwattr $C$DW$300, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x1bd)
	.dwattr $C$DW$300, DW_AT_decl_column(0x11)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$301, DW_AT_name("AssertCountEnable")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_AssertCountEnable")
	.dwattr $C$DW$301, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x1bf)
	.dwattr $C$DW$301, DW_AT_decl_column(0x11)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$302, DW_AT_name("CurrRunDirect")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_CurrRunDirect")
	.dwattr $C$DW$302, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x1c4)
	.dwattr $C$DW$302, DW_AT_decl_column(0x11)
	.dwendtag $C$DW$T$40

	.dwattr $C$DW$T$40, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
$C$DW$T$41	.dwtag  DW_TAG_typedef, DW_AT_name("S_RunStopStatus5")
	.dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$41, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x1c5)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x02)

$C$DW$T$42	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$303, DW_AT_name("all")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_all")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x1c9)
	.dwattr $C$DW$303, DW_AT_decl_column(0x15)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$304, DW_AT_name("bit")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_bit")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x1ca)
	.dwattr $C$DW$304, DW_AT_decl_column(0x13)
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x1c8)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
$C$DW$T$648	.dwtag  DW_TAG_typedef, DW_AT_name("U_RunStopStatus5")
	.dwattr $C$DW$T$648, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$648, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$648, DW_AT_decl_file("../include/GlobalVariables.h")
	.dwattr $C$DW$T$648, DW_AT_decl_line(0x1cb)
	.dwattr $C$DW$T$648, DW_AT_decl_column(0x02)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$305, DW_AT_name("ignore")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_ignore")
	.dwattr $C$DW$305, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x16)
	.dwattr $C$DW$305, DW_AT_decl_column(0x0b)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$306, DW_AT_name("modify")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_modify")
	.dwattr $C$DW$306, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x17)
	.dwattr $C$DW$306, DW_AT_decl_column(0x0b)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$307, DW_AT_name("PLCmodify")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_PLCmodify")
	.dwattr $C$DW$307, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x18)
	.dwattr $C$DW$307, DW_AT_decl_column(0x0b)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$308, DW_AT_name("changed")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_changed")
	.dwattr $C$DW$308, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x19)
	.dwattr $C$DW$308, DW_AT_decl_column(0x0b)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$309, DW_AT_name("rsv")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_rsv")
	.dwattr $C$DW$309, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$309, DW_AT_decl_column(0x0b)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$310, DW_AT_name("value")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_value")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$310, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$45

	.dwattr $C$DW$T$45, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x15)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("FuncBits")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x03)

$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x1ba)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$311, DW_AT_name("MenuModeSlt")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_MenuModeSlt")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x27)
	.dwattr $C$DW$311, DW_AT_decl_column(0x1a)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$312, DW_AT_name("AppDate")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_AppDate")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x28)
	.dwattr $C$DW$312, DW_AT_decl_column(0x1a)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$313, DW_AT_name("AutoDate")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_AutoDate")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x29)
	.dwattr $C$DW$313, DW_AT_decl_column(0x1a)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$314, DW_AT_name("DriveVer")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_DriveVer")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$314, DW_AT_decl_column(0x1a)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$315, DW_AT_name("BootVer")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_BootVer")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$315, DW_AT_decl_column(0x1a)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$316, DW_AT_name("ParaInit")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_ParaInit")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$316, DW_AT_decl_column(0x1a)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$317, DW_AT_name("ParaCopy")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_ParaCopy")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$317, DW_AT_decl_column(0x1a)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$318, DW_AT_name("MainFrqRef")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_MainFrqRef")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$318, DW_AT_decl_column(0x1a)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$319, DW_AT_name("OutFrqRef")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_OutFrqRef")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$319, DW_AT_decl_column(0x1a)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$320, DW_AT_name("OutFrq")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_OutFrq")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x30)
	.dwattr $C$DW$320, DW_AT_decl_column(0x1a)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$321, DW_AT_name("OutVoltage")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_OutVoltage")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x31)
	.dwattr $C$DW$321, DW_AT_decl_column(0x1a)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$322, DW_AT_name("OutCurrent")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_OutCurrent")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x32)
	.dwattr $C$DW$322, DW_AT_decl_column(0x1a)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$323, DW_AT_name("TorqCurrent")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_TorqCurrent")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x33)
	.dwattr $C$DW$323, DW_AT_decl_column(0x1a)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$324, DW_AT_name("MagFluxCurrent")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_MagFluxCurrent")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x34)
	.dwattr $C$DW$324, DW_AT_decl_column(0x1a)
$C$DW$325	.dwtag  DW_TAG_member
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$325, DW_AT_name("TorqRef")
	.dwattr $C$DW$325, DW_AT_TI_symbol_name("_TorqRef")
	.dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$325, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$325, DW_AT_decl_line(0x35)
	.dwattr $C$DW$325, DW_AT_decl_column(0x1a)
$C$DW$326	.dwtag  DW_TAG_member
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$326, DW_AT_name("OutTorq")
	.dwattr $C$DW$326, DW_AT_TI_symbol_name("_OutTorq")
	.dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$326, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$326, DW_AT_decl_line(0x36)
	.dwattr $C$DW$326, DW_AT_decl_column(0x1a)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$327, DW_AT_name("MotorPower")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_MotorPower")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x37)
	.dwattr $C$DW$327, DW_AT_decl_column(0x1a)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$328, DW_AT_name("MaxDriveTorque")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_MaxDriveTorque")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x38)
	.dwattr $C$DW$328, DW_AT_decl_column(0x1a)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$329, DW_AT_name("MaxBraveTorque")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_MaxBraveTorque")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x39)
	.dwattr $C$DW$329, DW_AT_decl_column(0x1a)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$330, DW_AT_name("DCVoltage")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_DCVoltage")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$330, DW_AT_decl_column(0x1a)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$331, DW_AT_name("DetMtrFrq")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_DetMtrFrq")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$331, DW_AT_decl_column(0x1a)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$332, DW_AT_name("MDIStatus")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_MDIStatus")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$332, DW_AT_decl_column(0x1a)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$333, DW_AT_name("DITermStatus")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_DITermStatus")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$333, DW_AT_decl_column(0x1a)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$334, DW_AT_name("DOTermStatus")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_DOTermStatus")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$334, DW_AT_decl_column(0x1a)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$335, DW_AT_name("AI1Volt")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_AI1Volt")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$335, DW_AT_decl_column(0x1a)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$336, DW_AT_name("AI2Volt")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_AI2Volt")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("../include/FunctionCode.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x40)
	.dwattr $C$DW$336, DW_AT_decl_column(0x1a)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$337, DW_AT_name("ConVolt")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_ConVolt")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
